[
{"company": "AAPL", "title": "Former Gap CEO reveals the only thing that could save Target", "publisher": "Yahoo Finance", "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=3_cc-session_3f49f5dc-a4b9-4345-8b28-88a9d5389e6a", "summary": "Target has to get back to being Target.", "time": "2025-12-01 13:08:36", "full_text": "Yahoo fait partie de la famille de marques Famille de marques Yahoo Les sites et applications que nous possédons et exploitons, notamment Yahoo, AOL, Engadget, In The Know et Makers. Yahoo . Si vous ne souhaitez pas que nos partenaires et nous–mêmes utilisions des cookies et vos données personnelles pour ces motifs supplémentaires, cliquez sur Refuser tout . Si vous souhaitez personnaliser vos choix, cliquez sur Gérer les paramètres de confidentialité . Vous pouvez révoquer votre consentement ou modifier vos choix à tout moment en cliquant sur les liens « Paramètres de confidentialité et des cookies » ou « Tableau de bord sur la confidentialité » présents sur nos sites et dans nos applications. Découvrez comment nous utilisons vos données personnelles dans notre Politique de confidentialité et notre Politique concernant les cookies ."},
{"company": "TSLA", "title": "Stock market today: Dow, S&P 500, Nasdaq futures sink, bitcoin plummets in downbeat start to December", "publisher": "Yahoo Finance", "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=3_cc-session_72ee7c11-d503-4741-87d5-93cb6bfad87b", "summary": "Wall Street's strong late-November rebound looks set to hit a speed bump on the first trading day of December.", "time": "2025-12-01 01:14:08", "full_text": "Yahoo fait partie de la famille de marques Famille de marques Yahoo Les sites et applications que nous possédons et exploitons, notamment Yahoo, AOL, Engadget, In The Know et Makers. Yahoo . Si vous ne souhaitez pas que nos partenaires et nous–mêmes utilisions des cookies et vos données personnelles pour ces motifs supplémentaires, cliquez sur Refuser tout . Si vous souhaitez personnaliser vos choix, cliquez sur Gérer les paramètres de confidentialité . Vous pouvez révoquer votre consentement ou modifier vos choix à tout moment en cliquant sur les liens « Paramètres de confidentialité et des cookies » ou « Tableau de bord sur la confidentialité » présents sur nos sites et dans nos applications. Découvrez comment nous utilisons vos données personnelles dans notre Politique de confidentialité et notre Politique concernant les cookies ."},
{"company": "AAPL", "title": "This Latin American E-Commerce Stock Could Be Worth $500 Billion in 10 Years", "publisher": "Motley Fool", "link": "https://www.fool.com/investing/2025/12/01/this-latin-american-e-commerce-stock-could-be/", "summary": "The stock has not done hugely well over the last five years but is poised for strong performance over the next decade.", "time": "2025-12-01 11:53:00", "full_text": "The stock has not done hugely well over the last five years but is poised for strong performance over the next decade. Many investors are biased toward stocks in their home country, especially the U.S. And who could fault them? The U.S. market has done phenomenally well over the last 40 to 50 years, producing huge winners for people who owned the likes of Microsoft and Apple , among many other stocks. But as we sit here today in late 2025, the U.S. stock market is trading at a premium average price-to-earnings ratio ( P/E ) versus the rest of the world. And yet, some overseas stocks could now provide a great value to investors. Consider MercadoLibre ( MELI +1.78% ) . Shares of the Latin American e-commerce powerhouse have underperformed over the last five years, and it now trades at a discount when compared to its long-term potential. Here's why the stock -- with its current market cap of $100 billion -- could be worth $500 billion in 10 years. MercadoLibre operates as an e-commerce platform and financial services business in countries including Mexico, Brazil, and Argentina. Founded over 25 years ago, the company has taken inspiration from the Amazon model to build up a huge network of buyers, sellers, and delivery infrastructure across its operating markets. On top of e-commerce, it has layered financial services from its Mercado Pago subsidiary, which now has 72 million monthly active users (MAUs) and grew revenue 65% year over year last quarter on a constant currency basis. Its multipronged business has enabled the company to grow impressively for many years. Total revenue was up 49% in constant currency last quarter. In U.S. dollar terms, revenue is up close to 4,000% cumulatively in the last 10 years, driven by its dual engines of e-commerce and fintech. Image source: Getty Images. Even though MercadoLibre is the largest e-commerce operator in Latin America, it is still significantly smaller than peers like Amazon since it generates just $26 billion in trailing-12-month revenue. E-commerce penetration in Latin America is much lower than other regions globally. This is due to a few reasons, including slower internet adoption, more difficult transportation routes, and poorer economies relative to places like East Asia and the U.S. Over time -- as long as these Latin American economies keep growing -- these gaps will fill in and e-commerce should keep spreading in Mexico and Brazil, providing a long-term tailwind. And we are seeing a major economic recovery in Argentina, which is one of the company's largest markets. This could turn a headwind into a tailwind if the reforms in that nation keep bearing fruit. MELI Revenue (TTM) data by YCharts; TTM = trailing 12 months. When looking at MercadoLibre's stock today, it does not seem overly cheap considering its trailing earnings before interest and taxes of just over $3 billion. With a market cap of $100 billion, that would give the stock a trailing earnings multiple between 30 and 35, depending on where the stock is trading. Anyone skeptical of the stock should zoom out and look at the long term. The company has grown impressively over the past two decades and should continue to do so in the years to come due to the factors discussed above. With higher-margin fintech revenue, its profit margin should be able to expand from the 10% level it sits at today. At $100 billion in revenue and a 20% profit margin, MercadoLibre could be generating $20 billion in earnings 10 years from now. I believe that would deserve a market cap of $500 billion, or 25 times these forward earnings estimates, making it not only the largest e-commerce player in Latin America, but also one of the largest businesses in the world. Brett Schafer has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Amazon, Apple, MercadoLibre, and Microsoft. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy . *Average returns of all recommendations since inception. Cost basis and return based on previous market day close. Related Articles Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2025 The Motley Fool . All rights reserved. Market data powered by Xignite and Polygon.io . About The Motley Fool Our Services Around the Globe Free Tools Affiliates & Friends"},
{"company": "TSLA", "title": "Exchange-Traded Funds, Equity Futures Lower Pre-Bell Monday Ahead of Manufacturing Reports", "publisher": "MT Newswires", "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=3_cc-session_8ed193ad-bc58-4327-8209-7629e83674ea", "summary": "The broad market exchange-traded fund SPDR S&P 500 ETF Trust (SPY) was down 0.7% and the actively tr", "time": "2025-12-01 13:57:43", "full_text": "Yahoo fait partie de la famille de marques Famille de marques Yahoo Les sites et applications que nous possédons et exploitons, notamment Yahoo, AOL, Engadget, In The Know et Makers. Yahoo . Si vous ne souhaitez pas que nos partenaires et nous–mêmes utilisions des cookies et vos données personnelles pour ces motifs supplémentaires, cliquez sur Refuser tout . Si vous souhaitez personnaliser vos choix, cliquez sur Gérer les paramètres de confidentialité . Vous pouvez révoquer votre consentement ou modifier vos choix à tout moment en cliquant sur les liens « Paramètres de confidentialité et des cookies » ou « Tableau de bord sur la confidentialité » présents sur nos sites et dans nos applications. Découvrez comment nous utilisons vos données personnelles dans notre Politique de confidentialité et notre Politique concernant les cookies ."},
{"company": "AAPL", "title": "Top Analysts Break Up 'Magnificent 7': Only Nvidia, Microsoft, and Apple Lead the Market", "publisher": "GuruFocus.com", "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=3_cc-session_4d3a2fa4-573a-4285-9a5a-1490d3a8c492", "summary": "Top Analysts Trim Big Tech: Only 3 Stocks Worth Watching", "time": "2025-12-01 10:53:52", "full_text": "Yahoo fait partie de la famille de marques Famille de marques Yahoo Les sites et applications que nous possédons et exploitons, notamment Yahoo, AOL, Engadget, In The Know et Makers. Yahoo . Si vous ne souhaitez pas que nos partenaires et nous–mêmes utilisions des cookies et vos données personnelles pour ces motifs supplémentaires, cliquez sur Refuser tout . Si vous souhaitez personnaliser vos choix, cliquez sur Gérer les paramètres de confidentialité . Vous pouvez révoquer votre consentement ou modifier vos choix à tout moment en cliquant sur les liens « Paramètres de confidentialité et des cookies » ou « Tableau de bord sur la confidentialité » présents sur nos sites et dans nos applications. Découvrez comment nous utilisons vos données personnelles dans notre Politique de confidentialité et notre Politique concernant les cookies ."},
{"company": "TSLA", "title": "Stocks Fall Pre-Bell as Investors Await Key Inflation Report, Fed Chair Powell's Remarks", "publisher": "MT Newswires", "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=3_cc-session_685d42f5-9643-4219-aef1-ef0b5d5c4dbe", "summary": "The benchmark US stock measures were lower before Monday's opening bell as investors await a key inf", "time": "2025-12-01 12:48:00", "full_text": "Yahoo fait partie de la famille de marques Famille de marques Yahoo Les sites et applications que nous possédons et exploitons, notamment Yahoo, AOL, Engadget, In The Know et Makers. Yahoo . Si vous ne souhaitez pas que nos partenaires et nous–mêmes utilisions des cookies et vos données personnelles pour ces motifs supplémentaires, cliquez sur Refuser tout . Si vous souhaitez personnaliser vos choix, cliquez sur Gérer les paramètres de confidentialité . Vous pouvez révoquer votre consentement ou modifier vos choix à tout moment en cliquant sur les liens « Paramètres de confidentialité et des cookies » ou « Tableau de bord sur la confidentialité » présents sur nos sites et dans nos applications. Découvrez comment nous utilisons vos données personnelles dans notre Politique de confidentialité et notre Politique concernant les cookies ."},
{"company": "TSLA", "title": "Tesla Sets New All-Time Car Sales Record in Norway", "publisher": "GuruFocus.com", "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=3_cc-session_f872bd13-d6db-4021-a90b-7ffa667202bd", "summary": "The automaker surpassed the country's full-year benchmark with one month remaining.", "time": "2025-12-01 12:03:21", "full_text": "Yahoo fait partie de la famille de marques Famille de marques Yahoo Les sites et applications que nous possédons et exploitons, notamment Yahoo, AOL, Engadget, In The Know et Makers. Yahoo . Si vous ne souhaitez pas que nos partenaires et nous–mêmes utilisions des cookies et vos données personnelles pour ces motifs supplémentaires, cliquez sur Refuser tout . Si vous souhaitez personnaliser vos choix, cliquez sur Gérer les paramètres de confidentialité . Vous pouvez révoquer votre consentement ou modifier vos choix à tout moment en cliquant sur les liens « Paramètres de confidentialité et des cookies » ou « Tableau de bord sur la confidentialité » présents sur nos sites et dans nos applications. Découvrez comment nous utilisons vos données personnelles dans notre Politique de confidentialité et notre Politique concernant les cookies ."},
{"company": "AAPL", "title": "Apple Moves to Block India Antitrust Case With Challenge to Penalty Law", "publisher": "GuruFocus.com", "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=3_cc-session_8a4bf01e-c5f9-4429-85bc-05fe38f833b6", "summary": "The company is challenging a law that could significantly raise potential fines.", "time": "2025-12-01 11:59:37", "full_text": "Yahoo fait partie de la famille de marques Famille de marques Yahoo Les sites et applications que nous possédons et exploitons, notamment Yahoo, AOL, Engadget, In The Know et Makers. Yahoo . Si vous ne souhaitez pas que nos partenaires et nous–mêmes utilisions des cookies et vos données personnelles pour ces motifs supplémentaires, cliquez sur Refuser tout . Si vous souhaitez personnaliser vos choix, cliquez sur Gérer les paramètres de confidentialité . Vous pouvez révoquer votre consentement ou modifier vos choix à tout moment en cliquant sur les liens « Paramètres de confidentialité et des cookies » ou « Tableau de bord sur la confidentialité » présents sur nos sites et dans nos applications. Découvrez comment nous utilisons vos données personnelles dans notre Politique de confidentialité et notre Politique concernant les cookies ."},
{"company": "AAPL", "title": "UK mortgage approvals slipped in October amid budget jitters", "publisher": "Yahoo Finance UK", "link": "https://uk.finance.yahoo.com/news/uk-mortgage-approvals-october-budget-130306229.html", "summary": "Mortgage approvals declined by 600 to 65,000 in October, data from the Bank of England show.", "time": "2025-12-01 13:03:06", "full_text": "Oops, something went wrong We are experiencing some temporary issues. The market data on this page is currently delayed. The UK's property sector showed signs of strain in October as uncertainty ahead of the autumn budget weighed, with the number of mortgages being approved for house purchase slipping, according to Bank of England (BoE) figures. Net mortgage approvals for house purchases slipped by around 600 to 65,000 in October, according to the BoE, while approvals for remortgaging fell by 3,600 to 33,100, the lowest level since February 2025. Net mortgage borrowing by individuals eased to £4.3bn, down from £5.2bn in September. Agents and analysts said buyers were unnerved by late-month speculation that the chancellor was considering a mansion tax on homes valued at £2m or more . Nathan Emerson, chief executive of Propertymark, said: “Speculation surrounding the autumn budget may have played a role in contributing towards a decrease in the number of mortgage approvals during this period.” The government ultimately introduced a high-value council tax surcharge in England on homes over £2m, effective April 2028. The measure will comprise four price bands, starting with an annual £2,500 surcharge for properties above £2mn and rising to £7,500 for those worth more than £5m. Read more: Bank savings are protected up to £120,000 under new UK rules Jason Tebb, president of OnTheMarket, said: “Intense speculation surrounding the budget and what it might have in store for the housing market had an impact on approvals for house purchases – an indicator of future borrowing.” Jeremy Leaf, the estate agent and former RICS residential chairman, added: “Mortgage approvals provide the best evidence of likely market activity over the next few months, and it’s clear from these figures that speculation about the chancellor’s budget took its toll.” Remortgaging activity, which only counts borrowers switching to a different lender, also slumped. The 33,100 approvals recorded in October marked the weakest reading since February. Richard Donnell, executive director at Zoopla, said: “Demand for mortgages to buy homes fell in October, as uncertainty around property tax announcements in the budget stalled activity in the housing market. Mortgage approvals are back to their five-year average, which points to housing sales of 1.15 million a year, and now that the threat of additional property taxes has been lifted from homes between £500,000 and £2m, we expect to see a rebound in demand as we enter the early months of 2026.” Zoopla had previously warned that rumours of broader property taxes, potentially on homes above £500,000, were adding to market jitters. Meanwhile, the BoE reported a slight easing in mortgage pricing. The “effective” interest rate on newly drawn home loans dipped to 4.17% in October, down from 4.19% the previous month, the lowest since January 2023. Read more: Were you a winner in the December 2025 premium bonds draw? Beyond the housing market, corporate borrowing also softened. Private non-financial companies made net repayments of £4.8bn in October, the largest monthly pay-down since October 2023. Consumer credit growth held steady at 7.2% year-on-year, with credit-card borrowing rising marginally to 10.9%. Households deposited an additional £6.8bn into banks and building societies, including £4.2bn funnelled into cash ISAs, up from September’s £2.4bn total. Budget changes to ISAs helped drive the surge. From April 2027, the annual adult cash ISA subscription limit will be reduced to £12,000, though the overall ISA allowance will remain £20,000. Savers over 65 will continue to access the full £20,000 cash ISA limit. Alice Haine, personal finance analyst at Bestinvest, said: “One data point that stands out, given the budget announcements on the future of Individual Saving Accounts (ISAs), is the £4.2bn funnelled into cash ISAs in October, almost doubling September’s subscriptions.” She added that many savers had been “spurred by speculation that cash Isa subscriptions could be capped well below the current £20,000 limit.” While the new £12,000 cap had been expected, some details caught analysts off guard. Haine noted: “This included the plan to limit the subscription cap to the under-65s, leaving retirees free to continue using the full £20,000 allowance for cash savings.” Read more: What is the new mansion tax? All you need to know She warned that HMRC intends to prevent savers from shielding cash within stocks and shares ISAs to get around the new rules, saying: “The government will ban transfers from stocks and shares ISAs to cash ISAs, apply a yet-to-be-known charge on interest earned on cash held in investment ISAs and potentially limit access to investments considered ‘cash like’ which might impact the ability to hold money market funds.” The upshot, she concluded, is that “the changes will make ISAs even more complex.” Mark Hicks, head of active savings at Hargreaves Lansdown, said the “boom in cash Isas” was continuing, helped by speculation over the coming changes. “This speculation has helped keep rates higher than they would otherwise have been, and I expect to continue to see an increase of flows into ISAs when we get November’s data,” he said, adding that savers should take advantage of higher fixed-term rates “ahead of the expected base rate cut later this month.” Lending trends diverged by business size: annual borrowing growth among large companies slowed to 6.9% in October from 8.2%, while the rate for SMEs held steady at 1.6%. Read more: How the income tax freeze will push millions into higher bands Salary sacrifice faces £2k cap but tax-free pension cash stays in budget The autumn budget explained in five charts Download the Yahoo Finance app, available for Apple and Android . Sign in to access your portfolio"}
]