[
{"company": "AAPL", "title": "Apple’s presumptive future CEO, John Ternus, has a tough act to follow", "publisher": "Yahoo Finance", "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=3_cc-session_722af2c0-1cf9-407f-b2e7-93a2b404d45a", "summary": "Replacing Tim Cook, who has been at Apple since Steve Jobs hired him in 1998, will be a tall task.", "time": "2025-11-22 15:34:13", "full_text": "Yahoo fait partie de la famille de marques Famille de marques Yahoo Les sites et applications que nous possédons et exploitons, notamment Yahoo, AOL, Engadget, In The Know et Makers. Yahoo . Si vous ne souhaitez pas que nos partenaires et nous–mêmes utilisions des cookies et vos données personnelles pour ces motifs supplémentaires, cliquez sur Refuser tout . Si vous souhaitez personnaliser vos choix, cliquez sur Gérer les paramètres de confidentialité . Vous pouvez révoquer votre consentement ou modifier vos choix à tout moment en cliquant sur les liens « Paramètres de confidentialité et des cookies » ou « Tableau de bord sur la confidentialité » présents sur nos sites et dans nos applications. Découvrez comment nous utilisons vos données personnelles dans notre Politique de confidentialité et notre Politique concernant les cookies ."},
{"company": "AAPL", "title": "5 Reasons I Still Love Apple Stock, Even After It Soared Higher", "publisher": "Motley Fool", "link": "https://www.fool.com/investing/2025/11/23/5-reasons-i-still-love-apple-stock-even-after-it-s/", "summary": "Apple's premium valuation rests on a powerful combination of a strong iPhone cycle and a growing stream of high-margin services revenue.", "time": "2025-11-23 19:41:00", "full_text": "Apple's premium valuation rests on a powerful combination of a strong iPhone cycle and a growing stream of high-margin services revenue. After a sharp rally in recent months, Apple ( AAPL +1.97% ) shares look expensive. The iPhone maker's stock has climbed to fresh highs, reflecting investors' growing confidence that the company has emerged from its growth lull and is heading into a stronger product and earnings cycle. Apple is still a hardware-focused business, but the story now leans more on services and the steady influence of its installed base. That shift, together with a clearer artificial intelligence road map, helps explain why the stock still carries a premium valuation. iPhone 17 Pro Max. Image source: Apple. After a sluggish stretch last year, Apple 's revenue has begun to reaccelerate. Revenue grew 4%, 5%, 0%, and then 8% year over year across the four quarters of fiscal 2025 (respectively), lifting full-year growth to more than 6% from just 2% growth in fiscal 2024. Importantly, this accelerated growth was driven by both hardware and services revenue. The current iPhone 17 cycle is a key driver of that rebound. iPhone revenue grew double digits year over year in the third quarter of fiscal 2025 and increased again in the fourth quarter as the new iPhone 17 lineup launched. Of course, the new iPhone models were available only for a few weeks during the fiscal fourth quarter. So, the real test will be during the important holiday period, which aligns with Apple's first quarter of fiscal 2026 (the current quarter). But based on management's comments on the latest iPhone models in the company's fiscal fourth-quarter earnings call, we already know the iPhone 17 is probably going to do well this holiday season. \"We're constrained today on several models of the iPhone 17,\" said Apple CEO Tim Cook in the company's latest earnings call . \"There's not a ramp issue. It's just we have very strong demand and we're working very hard to fulfill all the orders that we have.\" In addition, management specifically guided for double-digit year-over-year growth in iPhone revenue for the period. Apple's important services business, which is home to the App Store, Apple's native apps like Apple Music and Apple TV, and other services such as AppleCare, continues to grow faster than the rest of the company and carries a much higher gross margin than hardware sales. In the fourth quarter of fiscal 2025, services revenue grew 15% year over year, compared with 8% for the company as a whole. In addition, the important segment represented close to 30% of total revenue during the quarter. That shift toward recurring revenue sources in Apple's services business, including app store fees, cloud storage, payments, advertising, and subscriptions, should make Apple's business more resilient and -- importantly -- more profitable. After all, Apple's services business commands a gross margin of about twice that of the company's hardware business. Management's outlook adds another pillar to the bullish case. For the current quarter ending in December, Apple expects total revenue to grow 10% to 12% year over year, and iPhone revenue to grow at a double-digit rate. Viewing this guidance in light of the company's recent acceleration in the back half of fiscal 2025, that guidance suggests the current momentum is not just a one-quarter blip tied to product timing but something more sustainable. The final reason many investors remain comfortable owning Apple at a premium multiple is the potential for artificial intelligence (AI) to drive another hardware upgrade cycle. Apple has talked more openly this year about integrating AI across devices, from on-device models that power smarter photo and messaging features to a revamped Siri expected in 2026. The company has begun to ramp up capital spending and AI-related research and development. If AI features start to require more powerful devices better suited for fast-changing computing needs, Apple is positioned to capture that demand through new products in existing product lines and potentially even entirely new product lines enabled by AI. Taken together, these five pillars help explain why the market is willing to pay a rich price for Apple shares and why I personally remain bullish on the stock over the long haul. Trading at around 32 times forward earnings, the stock isn't cheap, and any unexpected setbacks in iPhone demand or services growth could pressure that multiple -- especially if AI initiatives disappoint. Still, I believe the upside opportunity outweighs the risks. Daniel Sparks and his clients have positions in Apple. The Motley Fool has positions in and recommends Apple. The Motley Fool has a disclosure policy . *Average returns of all recommendations since inception. Cost basis and return based on previous market day close. Related Articles Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2025 The Motley Fool . All rights reserved. Market data powered by Xignite and Polygon.io . About The Motley Fool Our Services Around the Globe Free Tools Affiliates & Friends"},
{"company": "TSLA", "title": "The Hits Keep on Coming for Tesla Investors", "publisher": "Motley Fool", "link": "https://www.fool.com/investing/2025/11/22/the-hits-keep-on-coming-for-tesla-investors/", "summary": "Investors often know when it rains it pours, and Tesla just received a little more bad news from a critical market.", "time": "2025-11-22 23:14:00", "full_text": "Investors often know when it rains it pours, and Tesla just received a little more bad news from a critical market. Tesla ( TSLA 1.10% ) has been a tale of two tales this year. The first part of the year brought a steep decline in share price as investors grappled with declining global sales, profits , and consumer backlash from Elon Musk's political antics. The next tale was of Tesla's swift and significant rebound in share price as investors looked to the future possibilities in artificial intelligence , robotics , and robotaxis . Tesla's next small speed bump has arrived, and this one comes in the form of disappointing news in a key market. Just about every automaker in China is having a rough time. The market much more quickly adopted electric vehicles (EVs) and the government helped subsidize domestic automakers to bolster their technology and innovation. It worked almost too well and the result was a plethora of advanced domestic electric vehicle makers that created a brutal price war. It dealt massive blows to foreign automakers that couldn't compete on product, price, or both. To make matters worse the overall industry has a problem with production overcapacity and now Chinese automakers are rushing to export vehicles overseas, potentially bringing ultra-competitive and highly advanced EVs to the U.S. doorstep which is currently protected by steep tariffs on import vehicles. Tesla has fared better than some competitors, but it has still felt the crunch in China. Recent data suggests more of the same: Tesla's sales in China dropped to 26,006 in October, the lowest in three years. Sales plunged 36% compared to the prior year, and the sales number was a far cry from September's figure of 71,525 when Tesla began deliveries of the Model Y L, a longer-wheelbase and six-seat version of the Model Y. Tesla's share of China's EV market checked in at a modest 3.2% in October, down substantially from 8.7% in September and its lowest again in three years. The silver lining, although it isn't much of one, is that Tesla's exports of China-made vehicles rose to a two-year high of 35,491 last month. Unfortunately, that silver lining only extends so far, and Tesla's struggles are widespread. In October, Tesla sales fell 23% year over year in four markets: North America, Europe, China, and South Korea, according to data tracked by Wells Fargo 's Colin Langan. Image source: Tesla. With Tesla's sales lagging in key markets around the world, and analysts expecting a slowdown in the North American EV market after the $7,500 federal tax credit expired at the end of September, one might think Tesla's stock would be in the dumps. That's far from the case -- Tesla's valuation remains insanely lofty at a price-to-earnings of roughly 290 and its market capitalization is more than Ford Motor Company and General Motors combined 10 times over. That's simply because investors and analysts are focused on Tesla's future potential. In fact, shareholders just approved with a 75% rate a compensation package for CEO Elon Musk that's valued at up to $1 trillion. The kicker is that many of Musk's milestones are based on future businesses: He needs to sell cars but also 10 million driver assistance subscriptions, 1 million robots, and commercially operate 1 million robotaxis. Ultimately, shareholders' vote on Musk's compensation package comes at an ideal time for investors to also revisit their investing thesis on Tesla. Tesla has the ability to innovate its way to a lucrative future based on AI, robotics, and driverless vehicles, but right now it's still mostly an automaker and that business isn't great currently. Investors would be wise to expect a few bumpy quarters from Tesla as it tries to navigate choppy waters that include an aging lineup, mounting lawsuits, consumer backlash and declining sales, struggling profits, a slow ramp in its robotaxi business, among other headwinds. Wells Fargo is an advertising partner of Motley Fool Money. Daniel Miller has positions in Ford Motor Company and General Motors. The Motley Fool has positions in and recommends Tesla. The Motley Fool recommends General Motors. The Motley Fool has a disclosure policy . *Average returns of all recommendations since inception. Cost basis and return based on previous market day close. Related Articles Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2025 The Motley Fool . All rights reserved. Market data powered by Xignite and Polygon.io . About The Motley Fool Our Services Around the Globe Free Tools Affiliates & Friends"},
{"company": "TSLA", "title": "Tesla's Roller Coaster Ride Continues With a Warning for Investors", "publisher": "Motley Fool", "link": "https://www.fool.com/investing/2025/11/22/tesla-roller-coaster-ride-continues-with-warning-f/", "summary": "Tesla's stock price rebound has been pleasant for investors, but here's something that might make them tap the brakes.", "time": "2025-11-22 18:14:00", "full_text": "Tesla's stock price rebound has been pleasant for investors, but here's something that might make them tap the brakes. It's been a roller coaster 2025 for Tesla ( TSLA 1.10% ) investors. The year started with the stock plunging from tariff and trade-policy headwinds, and a consumer backlash due to CEO Elon Musk's political activities. That was followed by a rebound on the hope that artificial intelligence (AI), robotaxis , and robotics could be more lucrative for the company than automaking . To continue the thrill ride, the company posted record third-quarter revenue, but commentary from a former employee could have investors pumping the brakes. Last week, Tesla reported record third-quarter revenue that topped Wall Street estimates thanks to a rush to buy electric vehicles (EVs) to lock in a key tax credit ahead of its expiration at the end of September. Total revenue was $28.1 billion during the third quarter, which topped analysts' average estimate of $26.37 billion, according to LSEG. The EV maker didn't do as well on the bottom line or other metrics, however. Adjusted earnings per share at $0.50 were below analysts' estimates calling for $0.55. Another closely watched metric -- the company's gross margin excluding regulatory credits -- checked in at 15.4% compared to an average estimate of 15.6%, according to Visible Alpha. Tesla's roughly 60% rebound in share price over the past six months and its $1.5 trillion market cap -- more than Ford and General Motors combined many times over -- is based more on the company's potential transformation to an AI, robotaxi service, and robotics business. Arguably at the forefront of that hype is its robotaxi service that was launched in limited capacity over the summer. But on that front, investors might want to pump the brakes, according to a former Tesla employee. Andrej Karpathy, the company's former head of AI who led the company's Autopilot and self-driving programs, said in a podcast that he would \"push back\" on the idea that progress on autonomous vehicles by Tesla and Alphabet 's Waymo means that all the technology's problems are solved. While autonomous driving developers have hit several milestones and progress continues, Karpathy thinks that there are still several steps on the road to full autonomy. Karpathy isn't the only person pushing back. The number of lawsuits facing Tesla and its claims of full self-driving capability are mounting, as are settlements and losses. Musk has claimed time and time again over the past few years that his company was close to having fully autonomous vehicles, but even its recent robotaxi launch in Austin, Texas, still used a human supervisor in the vehicles. It's top competitor, Waymo, moved beyond that requirement in 2020. A Tesla Cybertruck. Image source: Tesla Tesla is an intriguing and polarizing company with an equally compelling CEO at the wheel, and it has made many long-term investors very wealthy. But its valuation and market cap are in otherworldly territory, based partly on hype surrounding driverless vehicle technology, which the company is far from mastering or turning into a highly scaled and profitable business. One only has to look at CEO, Elon Musk's, recent compensation package that was passed with 75% approval from shareholders and could be worth up to $1 trillion. Much of that value is unlocked through milestones that suggest where the company is heading. Musk will of course still have to deliver vehicles and reaching 20 million deliveries is one milestone, but there's also one million robotaxis in commercial operation, one million Optimus robots, and 10 million Full Self-Driving subscriptions, and $400 billion in core profit. Tesla's best days may be ahead of it, but investors need to understand the higher-risk ride they're going on: Tesla isn't just an automaker, it's becoming a technology company heading toward uncertain territory. Daniel Miller has positions in Ford Motor Company and General Motors. The Motley Fool has positions in and recommends Alphabet and Tesla. The Motley Fool recommends General Motors. The Motley Fool has a disclosure policy . *Average returns of all recommendations since inception. Cost basis and return based on previous market day close. Related Articles Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2025 The Motley Fool . All rights reserved. Market data powered by Xignite and Polygon.io . About The Motley Fool Our Services Around the Globe Free Tools Affiliates & Friends"},
{"company": "TSLA", "title": "TSLA Stock Price Prediction: Where Tesla Could Be by 2025, 2026, 2030", "publisher": "Benzinga", "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=3_cc-session_b21c8108-339f-4fa5-b072-72d4e18a2a9f", "summary": "Analysts are saying Tesla could hit 1,003 dollars by 2030, a long-term target that has sparked renewed debate among investors deciding whether to lean into TSLA's volatility or wait for clearer signals. If you're bullish and looking for a low-cost way ...", "time": "2025-11-23 04:05:27", "full_text": "Yahoo fait partie de la famille de marques Famille de marques Yahoo Les sites et applications que nous possédons et exploitons, notamment Yahoo, AOL, Engadget, In The Know et Makers. Yahoo . Si vous ne souhaitez pas que nos partenaires et nous–mêmes utilisions des cookies et vos données personnelles pour ces motifs supplémentaires, cliquez sur Refuser tout . Si vous souhaitez personnaliser vos choix, cliquez sur Gérer les paramètres de confidentialité . Vous pouvez révoquer votre consentement ou modifier vos choix à tout moment en cliquant sur les liens « Paramètres de confidentialité et des cookies » ou « Tableau de bord sur la confidentialité » présents sur nos sites et dans nos applications. Découvrez comment nous utilisons vos données personnelles dans notre Politique de confidentialité et notre Politique concernant les cookies ."},
{"company": "TSLA", "title": "Tesla Stock Just Hit a Wall -- The Reversal Says More Than the Rally", "publisher": "GuruFocus.com", "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=3_cc-session_e70548f6-8121-4622-a312-1b8e88ea77e5", "summary": "Tesla's Meteoric Morning Rally Crashes Into a Brutal Late-Day Reversal", "time": "2025-11-23 06:58:42", "full_text": "Yahoo fait partie de la famille de marques Famille de marques Yahoo Les sites et applications que nous possédons et exploitons, notamment Yahoo, AOL, Engadget, In The Know et Makers. Yahoo . Si vous ne souhaitez pas que nos partenaires et nous–mêmes utilisions des cookies et vos données personnelles pour ces motifs supplémentaires, cliquez sur Refuser tout . Si vous souhaitez personnaliser vos choix, cliquez sur Gérer les paramètres de confidentialité . Vous pouvez révoquer votre consentement ou modifier vos choix à tout moment en cliquant sur les liens « Paramètres de confidentialité et des cookies » ou « Tableau de bord sur la confidentialité » présents sur nos sites et dans nos applications. Découvrez comment nous utilisons vos données personnelles dans notre Politique de confidentialité et notre Politique concernant les cookies ."},
{"company": "TSLA", "title": "Musk Says Tesla Nears AI5 Chip Tape Out, Starting Work on AI6", "publisher": "Bloomberg", "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=3_cc-session_456a24f3-70ad-4186-9f05-1fbd7ac60345", "summary": "“Our goal is to bring a new AI chip design to volume production every 12 months,” said Musk, the world’s richest person.  Musk said at the time that a new Samsung facility in Texas would be dedicated to making the AI6 chip.  “We expect to build chips at higher volumes ultimately than all other AI chips combined,” Musk said in Sunday’s post.", "time": "2025-11-23 08:30:13", "full_text": "Yahoo fait partie de la famille de marques Famille de marques Yahoo Les sites et applications que nous possédons et exploitons, notamment Yahoo, AOL, Engadget, In The Know et Makers. Yahoo . Si vous ne souhaitez pas que nos partenaires et nous–mêmes utilisions des cookies et vos données personnelles pour ces motifs supplémentaires, cliquez sur Refuser tout . Si vous souhaitez personnaliser vos choix, cliquez sur Gérer les paramètres de confidentialité . Vous pouvez révoquer votre consentement ou modifier vos choix à tout moment en cliquant sur les liens « Paramètres de confidentialité et des cookies » ou « Tableau de bord sur la confidentialité » présents sur nos sites et dans nos applications. Découvrez comment nous utilisons vos données personnelles dans notre Politique de confidentialité et notre Politique concernant les cookies ."},
{"company": "TSLA", "title": "Should You Buy Alphabet Stock After Warren Buffett's New $4 Billion Bet?", "publisher": "Motley Fool", "link": "https://www.fool.com/investing/2025/11/23/should-you-buy-alphabet-stock-after-warren-buffett/", "summary": "Warren Buffett added Alphabet stock to Berkshire's portfolio during the third quarter.", "time": "2025-11-23 16:15:00", "full_text": "Warren Buffett added Alphabet stock to Berkshire's portfolio during the third quarter. Over the past three years, institutional and retail investors have poured record sums into artificial intelligence (AI) stocks. In particular, a small collective known as the \"Magnificent Seven\" -- comprised of Nvidia , Apple , Microsoft , Alphabet ( GOOGL +3.50% ) ( GOOG +3.33% ) , Amazon , Meta Platforms , and Tesla -- are among the most closely held stocks across the entire S&P 500 . One notable investor who stayed on the sidelines throughout the AI revolution, however, is Warren Buffett. Over the last few years, Buffett's investment conglomerate, Berkshire Hathaway , was stockpiling record levels of cash while everyone else raced to buy more technology stocks. BRK.B Cash and Short Term Investments (Quarterly) data by YCharts These dynamics are beginning to shift. According to Berkshire's latest 13F filing , the investment firm bought 17.8 million shares of Alphabet during the third quarter -- a stake that is now worth about $4.3 billion. Notably, Alphabet was the only stock Berkshire purchased in the third quarter . Let's break down Buffett's investment philosophy and explore how Alphabet fits into that equation. From there, I'll take a look at Alphabet's valuation metrics to help determine if now is a good time to follow Buffett's lead. If you want to learn how to invest like Warren Buffett , you're in luck. While the Oracle of Omaha ranks among the world's wealthiest people, Buffett's approach to investing is quite simple. Berkshire's portfolio does not feature speculative companies involved in volatile industries. Instead, Buffett seeks out durability. Against this backdrop, it's not surprising that companies like Apple , Coca-Cola , American Express , and Chevron are some of Buffett's largest positions. Each of these is considered a blue chip company that produces steady, predictable cash flow. Moreover, these businesses often reinvest their profits into shareholder rewards programs such as dividends or stock buybacks . In essence, Buffett pounces on businesses with best-in-class brand recognition that sell products that people need in their daily lives. Given these dynamics, many of the positions in Berkshire's portfolio could be seen as stocks that long-term investors can own forever . Image source: The Motley Fool. Alphabet checks off many of Buffett's boxes. The company owns two of the most recognizable brands on the planet: internet search platform Google and video-sharing website YouTube. Given the level of internet surface area that Alphabet covers, it's obvious why advertisers are eager to capitalize on the engagement the company generates. This gives Alphabet enormous leverage in the form of pricing power , which directly translates into a steady, highly profitable operation. Beyond advertising, Alphabet has also built a thriving cloud computing platform, Google Cloud, which competes with Amazon Web Services ( AWS ) and Microsoft Azure. Underneath this umbrella sits a custom hardware offering, called tensor processing units (TPUs). Layering cloud software with custom silicon gives Alphabet a direct line into the semiconductor industry -- enabling it to take on incumbents like Nvidia and Advanced Micro Devices . Lastly, Alphabet also has a large consumer electronics business in Android -- which competes with Apple -- and is also taking on Tesla in the world of autonomous driving through its subsidiary, Waymo . Alphabet's diverse ecosystem provides the company with an enviable degree of flexibility -- a form of malleability that positions it to pivot and grow during virtually any economic cycle or emerging technology trend. In turn, the company is consistently profitable, which Alphabet uses to reinvest in innovation as well as reward shareholders through a modest dividend program. Image source: Getty Images. In my view, it's unlikely that Buffett decided to initiate a position in Alphabet purely based on the AI narrative. Berkshire's portfolio has always featured a limited number of technology businesses. However, among the tech stocks that Buffett has chosen, a common theme arises. In addition to Apple, Berkshire also has positions in Amazon and now Alphabet. Each of these companies has built diversified ecosystems across software, hardware, and consumer services. GOOGL PE Ratio (Forward) data by YCharts With a forward price -to-earnings (P/E) multiple of 28, Alphabet stock is no longer trading at a bargain. While paying a premium is uncharacteristic of Buffett, Alphabet is still the second-cheapest stock among the Magnificent Seven -- suggesting investors may not be fully pricing in the company's next growth phase. In my eyes, Buffett is still sticking to his playbook -- identifying relative value in an otherwise frothy market. Furthermore, I think the timing of Berkshire's purchase of Alphabet stock is telling. In other words, if Buffett and his constituents felt that AI was a fad or a bubble , then Berkshire would not have bought Alphabet stock. With these ideas in mind, I think Alphabet remains an attractive opportunity given its proven durability and compelling long-term potential -- with or without AI playing a role in the thesis. American Express is an advertising partner of Motley Fool Money. Adam Spatacco has positions in Alphabet, Amazon, Apple, Meta Platforms, Microsoft, Nvidia, and Tesla. The Motley Fool has positions in and recommends Advanced Micro Devices, Alphabet, Amazon, Apple, Berkshire Hathaway, Chevron, Meta Platforms, Microsoft, Nvidia, and Tesla. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy . *Average returns of all recommendations since inception. Cost basis and return based on previous market day close. Related Articles Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2025 The Motley Fool . All rights reserved. Market data powered by Xignite and Polygon.io . About The Motley Fool Our Services Around the Globe Free Tools Affiliates & Friends"},
{"company": "TSLA", "title": "On-Chain Stocks Could Misprice Over Weekends, Triggering Arbitrage Risks: RedStone", "publisher": "CoinDesk", "link": "https://www.coindesk.com/business/2025/11/23/on-chain-stocks-could-misprice-over-weekends-triggering-arbitrage-risks-redstone", "summary": "This gap could create a \"price dislocation\" between on-chain and traditional markets, leading to potential losses or arbitrage opportunities.", "time": "2025-11-23 13:00:00", "full_text": "As real-world asset (RWA) tokenization surges, the crypto industry is entering unfamiliar territory, bringing traditional equities, private credit, and commercial paper onchain and uncovering potential critical risks along the way. Marcin Kaźmierczak, co-founder of oracle provider RedStone, says a risk is potentially being overlooked: the weekend gap, where crypto trades 24/7, while Wall Street does not. In traditional finance, if disaster strikes a company over the weekend, the market is closed and then the stock \"gaps down\" when the opening bell rings on Monday. Meanwhile, in the crypto market, trading never stops. As more stocks are brought onchain, the gap in weekend trading on the blockchain for traditional equities versus when the market opens on Monday could pose a risk, according to Kaźmierczak. For example, a tokenized version of Tesla stock that is traded on a decentralized exchange allows traders to buy and sell it at 3:00 a.m. on a Sunday, while the TradFi market remains closed. “Imagine if a Tesla factory explodes over the weekend—traditional markets are closed, but on-chain markets are open,” Kaźmierczak said in an interview with CoinDesk at Devconnect Buenos Aires. “We might see a dislocation of the tokenized stock versus the real value on Nasdaq.\" This mismatch, he argues, could create what he calls a \"price dislocation ,\" where an on-chain asset appears stable, but only because the oracles, which send data from the outside world to a blockchain, have stopped updating prices. Major providers typically freeze equity price feeds when U.S. markets close at 4 p.m. ET Friday, resuming only Monday morning. In that window, on-chain versions of Tesla, or any other stock, could keep trading, even if their real-world price should have changed dramatically. Most tokenized stock trading activity is currently focused on centralized exchanges, where trading of these products is often limited during the weekend. But the goal of the industry is to make these tokenized stocks permissionless and available in DeFi protocols. That means 24/7 activity. If the oracle doesn't update until markets reopen, on-chain protocols could be trading on \"ghost\" prices, creating massive arbitrage opportunities or leaving lending protocols under-collateralized. The problem intensifies with complexity. While stablecoins are relatively safe, Kaźmierczak pointed out that the market is shifting toward more complex products, such as tokenized portfolios of credit, commercial paper, and equities. “Essentially, we are seeing launching a hedge fund on-chain,” Kaźmierczak noted, describing future portfolios that might be \"50% allocated into T-Bills, 20% into private credit, 20% into commercial paper, and 10% actively managed.\" If oracles lag during real-world volatility, structured DeFi protocols could be left mispricing assets. RedStone advocates for a modular oracle architecture and supports both “Push” and “Pull” models. In the \"Pull\" model, users get data delivered on-chain when they interact with a protocol, meaning \"the data is always fresh,\" according to Kaźmierczak. However, he conceded that most protocols still rely on the older model because it is easier to integrate. “Right now, it's probably like 90% of solutions using the Push Oracle,” he said, noting that while \"Pull\" was an innovation for scaling, the majority of the market still adapts the legacy standard. Until oracles and protocols evolve to account for these timing mismatches, Kaźmierczak suggested that the premise of 24/7 tokenized finance carries inherent risks. As more RWAs go live, the challenge will be managing the gap between open protocols and closed traditional markets. “We still need to see how they behave on the weekend,” Kaźmierczak warned. Read more: Nasdaq Seeks Nod From U.S. SEC to Tokenize Stocks More For You Protocol Research: GoPlus Security What to know : More For You Could Stablecoins Spark a New Contagion? BIS Warns, Coinbase Pushes Back Not all agree with some recent sentiment that stablecoins pose a threat to global financial stability. What to know : Disclosure & Polices : CoinDesk is an award-winning media outlet that covers the cryptocurrency industry. Its journalists abide by a strict set of editorial policies . CoinDesk has adopted a set of principles aimed at ensuring the integrity, editorial independence and freedom from bias of its publications. CoinDesk is part of Bullish (NYSE:BLSH), an institutionally focused global digital asset platform that provides market infrastructure and information services. Bullish owns and invests in digital asset businesses and digital assets and CoinDesk employees, including journalists, may receive Bullish equity-based compensation."},
{"company": "TSLA", "title": "Could Buying Robinhood Stock Today Set You Up for Life?", "publisher": "Motley Fool", "link": "https://www.fool.com/investing/2025/11/23/could-buying-robinhood-stock-today-set-you-up-for/", "summary": "Robinhood stock has surged 250% over the past year. Can it continue delivering for investors?", "time": "2025-11-23 18:15:00", "full_text": "Robinhood stock has surged 250% over the past year. Can it continue delivering for investors? Everyone hopes to uncover the next Nvidia or Tesla , a stock that skyrockets and turns early investors into millionaires. It's tempting to see these stellar returns and imagine the wealth you could have built if you'd bought those stocks early. Robinhood ( HOOD +1.03% ) may be one of those stocks for some investors. About two years ago, the stock traded around $8 per share, and today it's trading at $115 per share. In other words, a $10,000 investment would be worth $143,750 today. But that's the past. Could investing in Robinhood today be the ticket to setting you up for life? Let's dive into the business and explore the potential Robinhood offers investors today. Image source: Getty Images. Robinhood has experienced an impressive turnaround in the past several years. A few years ago, the company struggled with the meme-stock frenzy and the regulatory scrutiny that followed. Customers were unhappy, and regulators threatened its payment for order flow business model, which could have taken down its primary revenue source. Since then, Robinhood has transformed its business. The company has attracted significant capital to its platform by using elevated interest rates to encourage customers to bring funds to the platform. This strategy has proven to be quite effective. Since the start of 2024, Robinhood's total platform assets have grown from $102 billion to $343 billion as of the end of October. A key aspect of Robinhood's growth is its Gold membership account. Customers can pay $5 per month or $50 per year to earn higher interest rates and other benefits. This subscription service provides Robinhood with a steady stream of income. Additionally, users who subscribe to Robinhood Gold have more assets and engage with the platform more frequently than non-subscribers. Robinhood's recent quarterly results were solid, with revenue of $1.27 billion and earnings per share of $0.61, both slightly ahead of consensus estimates. Its quarterly results were helped by solid transaction revenue growth along with an increase in net interest income. Transaction-based revenue surged 129% to $730 million, driven by growth in cryptocurrency (up 300%), options (50%), and equities (132%). Meanwhile, its average revenue per user (ARPU) rose 82% to $191, while net interest revenue increased 66% to $456 million. HOOD Revenue (TTM) data by YCharts Robinhood continues to roll out new offerings, too. For example, successfully monetizing its prediction markets product could be a powerful new revenue source for the company. Its prediction markets business surpassed $100 million in annualized revenue in less than a year. Using October volume, analysts at Bernstein noted that this business is tracking toward a $300 million run rate . CEO Vlad Tenev noted that Robinhood Prediction Markets had traded 4 billion event contracts all-time, with over 2 billion in the third quarter alone. The company aims to expand its prediction markets product into countries outside the U.S., engaging with overseas regulators such as the U.K.'s Financial Conduct Authority. Robinhood is also looking to expand its addressable market by offering retail investors access to asset classes that have traditionally been reserved for institutions. The company announced the filing of an initial registration statement for Robinhood Ventures Fund I, a closed-end fund. This vehicle aims to provide retail investors with exposure to private companies . It is also planning to create a route for amateur investors to invest in private AI companies. Relying on any single stock to set you up for life is a tall task. You would need staggering returns or a hefty initial investment in a single stock for this to happen. For example, if you buy $10,000 in Robinhood stock today, you would need it to grow at a nearly 26% compound annual growth rate for the next 20 years to get to $1 million. Robinhood has done an excellent job growing its business after heightened scrutiny a few years ago. The company continues to expand into new markets, and I'm optimistic about what the future holds for Robinhood. The stock isn't cheap, priced at 47 times this year's projected earnings per share, reflecting the optimistic growth projections investors have today. That said, I like Robinhood and think it has solid growth potential. While you don't want to rely on any single investment to build wealth, I like Robinhood stock as a small piece of a well-diversified portfolio . Courtney Carlsen has positions in Nvidia and Robinhood Markets. The Motley Fool has positions in and recommends Nvidia and Tesla. The Motley Fool has a disclosure policy . *Average returns of all recommendations since inception. Cost basis and return based on previous market day close. Related Articles Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2025 The Motley Fool . All rights reserved. Market data powered by Xignite and Polygon.io . About The Motley Fool Our Services Around the Globe Free Tools Affiliates & Friends"},
{"company": "TSLA", "title": "Ranking the Best \"Magnificent Seven\" Stocks to Buy for 2026. Here's My No. 7 Pick.", "publisher": "Motley Fool", "link": "https://www.fool.com/investing/2025/11/23/ranking-magnificent-seven-stocks-buy-2026-seven/", "summary": "These megacap companies have rewarded investors with epic long-term gains, but one -- Tesla -- may now be overextended.", "time": "2025-11-23 18:05:00", "full_text": "These megacap companies have rewarded investors with epic long-term gains, but one -- Tesla -- may now be overextended. Nvidia , Microsoft , Apple , Alphabet , Amazon , Meta Platforms , and Tesla ( TSLA 1.10% ) form an elite group of companies known as the \" Magnificent Seven \" due to their industry leadership and market influence. As many of these companies continue to deliver market-beating returns, the Magnificent Seven now comprise a remarkable 35% of the value of the S&P 500 . In a series of articles, I'll be ranking each of these stocks and discussing why some are still chock-full of untapped potential, while others should be avoided by investors. Here's why Tesla is my least favorite of the bunch to buy in 2026. Image source: Tesla. If Tesla can effectively monetize some of its larger bets, such as its planned Robotaxi network, its humanoid robots, or its other artificial intelligence (AI) endeavors, it could easily be the single best Magnificent Seven stock to buy and hold for the next five to 10 years. But that's a big \"if.\" The major difference between Tesla and the other Magnificent Seven companies is that its core business is struggling. By comparison, revenue growth remains strong for Apple's iPhone and services categories. Amazon Web Services generates gobs of free cash flow that funds the company's other ambitions. Alphabet and Microsoft each generate sizable earnings from a variety of digital segments, including cloud computing infrastructure , where they're both major players. Meta Platforms has its highly profitable \"family of apps\" segment, which brings in more than enough to support its billions of dollars in losses from Reality Labs , which contains its metaverse-related operations. And Nvidia's compute and networking segment continues to deliver jaw-dropping results, while its smaller segments are also highly profitable. By contrast, Tesla's electric vehicle (EV) deliveries were trending downward in the first half of 2025, though it remains the market leader. Its energy storage business is on firmer footing, but it makes up a small part of the top line. In the third quarter, Tesla grew automotive revenue just 6% year over year as deliveries rebounded, up 7%. However, the company's operating margin fell to just 5.8% -- a steep decline from 10.8% a year earlier. Tesla is spending a ton of money on artificial intelligence and robotics, but it has yet to see a payoff from those investments. This past summer, Tesla launched its autonomous ride-hailing service in Austin, Texas, and it has since expanded it to a few other markets, including the San Francisco Bay Area. However, it remains to be seen how profitable it will be at scale. It's also worth noting that, so far, that service is being provided by standard Model Y EVs that have been outfitted with Tesla's Robotaxi technology, not the much-discussed Cybercab, which is not yet in production. And in most markets, regulators are still requiring human monitors for those autonomous vehicles. Tesla's Robotaxis feature pioneering-edge AI, which presents distinct challenges compared to embedding AI within smartphones or personal computers, so the company deserves credit for making progress in that field. However, the risks of investing in Tesla simply aren't worth the potential rewards at this time, especially given the fact the stock is trading at 178 times expected 2026 earnings. Since Tesla's valuation appears to be increasingly disconnected from its core EV business and based more on the potential of new ventures that have yet to prove themselves, investors may want to take a \"wait and see\" approach to the stock at this time. There are many other compelling buys in big tech . Stay tuned to find out how the remaining Magnificent Seven stocks stack up in my rankings for 2026. Daniel Foelber has positions in Nvidia. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, Meta Platforms, Microsoft, Nvidia, and Tesla. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy . *Average returns of all recommendations since inception. Cost basis and return based on previous market day close. Related Articles Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2025 The Motley Fool . All rights reserved. Market data powered by Xignite and Polygon.io . About The Motley Fool Our Services Around the Globe Free Tools Affiliates & Friends"},
{"company": "TSLA", "title": "I Would Buy Tesla Stock at This Price", "publisher": "Motley Fool", "link": "https://www.fool.com/investing/2025/11/24/i-would-buy-tesla-stock-at-this-price/", "summary": "Tesla is a remarkable company with great prospects. But price matters.", "time": "2025-11-24 08:31:00", "full_text": "Tesla is a remarkable company with great prospects. But price matters. Tesla ( TSLA 1.10% ) is a fascinating business. The electric-vehicle and energy company is pushing into autonomous ride-sharing and humanoid robots while still ramping its core electric vehicle and energy storage operations. I admire what Tesla is building and expect the company to be extremely successful over time. But valuation is a critical part of investing -- and at today's price, the stock already bakes significant growth for years to come, leaving very little margin of safety if the company's growth plans take longer than expected or if expanding into these new business lines costs more than anticipated. With this backdrop in mind, I'd buy into the story -- but only at the right price. Tesla's unreleased Cybercab vehicle. Image source: Tesla. After a sluggish first half of 2025, Tesla returned to double-digit revenue growth in Q3. Total revenue for the period reached $28.1 billion, a 12% increase year over year, driven by record vehicle deliveries and strong demand for large-scale energy storage projects. Automotive revenue rose 6% year over year to about $21.2 billion, while the energy generation and storage segment grew revenue 44% to roughly $3.4 billion as deployments reached 12.5 gigawatt-hours. The company delivered more than 497,000 vehicles in the quarter. Profitability, however, told a different story. Third-quarter operating income fell 40% year over year to $1.6 billion, and operating margin dropped to 5.8% from 10.8% a year earlier. Operating expenses increased by 50% to approximately $3.4 billion, as the company invested heavily in artificial intelligence infrastructure and new product development. As of this writing, the stock has a price-to-earnings ratio of about 270 and trades at about 14 times sales. Those are demanding multiples for a company that still earns most of its revenue from selling vehicles. And even if investors expect Tesla to look more like a high-margin software and services platform over time, today's valuation already prices this in. In the meantime, Tesla's business remains capital-intensive. But management hopes high-margin businesses -- self-driving software sales and an autonomous ride-sharing network -- can help the company transform into a technology company with tech company -like margins. Then there's Tesla's plans for humanoid robots, but it's unclear what kind of margins it can achieve in such an unprecedented business. The problem? Each of Tesla's growth initiatives will require significant sums of capital to scale. In addition, there's timing risk. These growth initiatives carry technical and regulatory risk that could delay commercialization. Investors can already see the strain. Operating expenses in the third quarter rose much faster than revenue. That kind of spending is understandable for a company that believes it has an opportunity of unusual size. But does the stock's valuation leave enough room for the risks associated with building out these new product initiatives? At a price that values Tesla well over 250 times current earnings and about 170 times forward earnings , even modest setbacks in autonomy timelines or vehicle demand could create sharp swings in the stock. That is why my own discipline points to a lower entry point. I believe that at around $220 per share, the stock would still carry a valuation that reflects Tesla's position in electric vehicles and its growth opportunities in higher-margin businesses. Of course, this doesn't mean investors should sell shares they already own. Extreme volatility is part of owning a stock with so much future potential baked in. So it's normal for shares to trade in a wide band. In addition, given Tesla's long history of incredible growth, the company could very well exceed even my most optimistic expectations. Still, I'm happy to admire the business from the sidelines and keep my buy price near $220, for now. This, of course, is a moving target that may very well move up over time as I get new information about Tesla's ever-expanding business. While there's no guarantee shares actually fall to this price, I'll be ready if they do. In the meantime, I'll take new capital elsewhere. Daniel Sparks and/or his clients have positions in Tesla. The Motley Fool has positions in and recommends Tesla. The Motley Fool has a disclosure policy . *Average returns of all recommendations since inception. Cost basis and return based on previous market day close. Related Articles Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2025 The Motley Fool . All rights reserved. Market data powered by Xignite and Polygon.io . About The Motley Fool Our Services Around the Globe Free Tools Affiliates & Friends"},
{"company": "AAPL", "title": "Mark Gurman Says Tim Cook Likely To Remain As Apple CEO Through At Least Mid-2026", "publisher": "Benzinga", "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=3_cc-session_19dfdadb-6b0a-4eb7-9f1d-a3008b50ab02", "summary": "Bloomberg’s Mark Gurman has shared that Apple Inc. (NASDAQ:AAPL) CEO Tim Cook is likely to retain his position until at least mid-2026, a claim that contradicts earlier reports. What Happened: The Financial Times had earlier reported this month that Apple was gearing up for Cook’s departure “as soon as next year.” This report had triggered speculations about a potential leadership transition ahead of Apple’s annual events. However, Gurman, in his latest \"Power On” report, refuted this claim. Gur", "time": "2025-11-23 20:58:51", "full_text": "Yahoo fait partie de la famille de marques Famille de marques Yahoo Les sites et applications que nous possédons et exploitons, notamment Yahoo, AOL, Engadget, In The Know et Makers. Yahoo . Si vous ne souhaitez pas que nos partenaires et nous–mêmes utilisions des cookies et vos données personnelles pour ces motifs supplémentaires, cliquez sur Refuser tout . Si vous souhaitez personnaliser vos choix, cliquez sur Gérer les paramètres de confidentialité . Vous pouvez révoquer votre consentement ou modifier vos choix à tout moment en cliquant sur les liens « Paramètres de confidentialité et des cookies » ou « Tableau de bord sur la confidentialité » présents sur nos sites et dans nos applications. Découvrez comment nous utilisons vos données personnelles dans notre Politique de confidentialité et notre Politique concernant les cookies ."},
{"company": "AAPL", "title": "These 3 Dow Stocks Are Set to Soar in 2026 and Beyond", "publisher": "Motley Fool", "link": "https://www.fool.com/investing/2025/11/23/these-3-dow-stocks-are-set-to-soar-in-2026-and-bey/", "summary": "The planets are lining up for some market-beating performances.", "time": "2025-11-24 04:00:00", "full_text": "The planets are lining up for some market-beating performances. Artificial intelligence (AI) stocks have obviously led the market higher over the past couple of years, and by extension, helped the tech-heavy Nasdaq Composite to outperform other market indexes. Indeed, AI stocks' performances almost seem to have come at everything else's expense. There's only so much investment capital to go around, after all. With the artificial intelligence rally getting a bit long in the tooth though -- with talk of an AI bubble on the verge of popping -- it might be wise to start positioning for a rotation out of the market's most-loved technology darlings and into something more traditionally blue chippy . The Dow Jones Industrial Average would be a great place to start that search. Here's a closer look at three Dow stocks that could soar in 2026, and then keep soaring after that. Image source: Getty Images. It seems strange to suggest Walmart ( WMT 1.67% ) shares are capable of soaring. Although the stock certainly has its bullish moments, there's still only so much growth that can be achieved by selling basic consumer goods through a network of brick-and-mortar retail stores. And to be fair, Walmart's version of soaring isn't quite what it would be with names like Nvidia or IonQ . Still, given the relatively less risk and volatility Walmart brings to the table, this stock should perform surprisingly well in the year ahead for a couple of reasons. One of those reasons was just underscored with the release of the company's fiscal third-quarter numbers. Revenue grew 5.8% year over year to $179.5 billion versus expectations of $177.4 billion for Q3 of fiscal year 2026, which ended Oct. 31, 2025. Adjusted earnings of $0.62 per share topped estimates of $0.60. Same-store sales within the United States (where Walmart does about two-thirds of its business) improved by 4.5% versus a tough year-earlier comparison of 5.3%. Were it just this one quarter it might be chalked up as a stroke of luck. It's not just this one quarter, though. This sort of growth and outperformance has been the norm for the better part of the past few years. It's a sign that the retailer 's pricing, positioning, and perks are all resonating with consumers of all income demographics. Other similar retailers can't claim the same. As for the other reason Walmart shares are set to rally in 2026 and beyond, despite the company's persistently impressive performance of late, the stock hasn't exactly reflected this. Even with the recent post-earnings leap shares are still only barely above their February peak. There's plenty of room to tack on more gains from here. It's been downright agonizing to be a Boeing ( BA +0.18% ) shareholder since 2019. Just when it looks like the company's finally going to shake off all the misery that its new (and lauded) 737 Max and 787 Dreamliner jets have caused, a new problem seems to surface, upending the stock. Shares are currently trading right about where they were in the middle of 2017, in fact. Consistent net losses during this stretch certainly haven't helped either. The funny thing is, despite all the company's plane-design woes, airlines continue to order more and more of them. As of the end of the third quarter Boeing's production backlog stood at record-breaking $635 billion worth of orders. Data source: The Boeing Co. Chart by author. Most of these orders can be canceled, for the record. But most of them won't be, given that the average age of jetliners still in active use today is just under a record-breaking 15 years (according to the International Air Transport Association). More and more of these planes are going to need to be replaced in the foreseeable future. Indeed, Boeing expects the airline industry to take delivery of 43,600 new planes between now and 2044 just to keep up with the growing demand for air travel. For perspective, there are only a little more than 27,000 jetliners currently in airlines' active fleets. The year ahead may be the year the industry as well as investors are finally forced to connect these dots and start pricing this bigger picture into Boeing's shares. Finally, add Apple ( AAPL +1.78% ) to your list of Dow stocks that could soar in 2026 and beyond. It's not been a bad performer this year. In fact, Apple shares recently hit a record high . There's no denying, however, the stock's been held back by the company's botched entry into the consumer-facing artificial intelligence (AI) space; Apple Intelligence just wasn't ready for deployment when it became available in October last year. Neither was the updated version of its AI-powered digital assistant Siri. Disappointing AI software, of course, negates the need for Apple's newest AI-capable hardware than can use it, which is why iPhone revenue only improved about 4% over the course of the past four reported quarters. One has to assume, however, the company's going to make sure it gets it right the next time around, particularly with the rerelease of an updated Siri slated for sometime early in the coming year. This will also give consumers more time to warm up to the idea of onboard artificial intelligence tools, as well as give the company a chance to develop and introduce a cheaper version of the AI-capable iPhone 17 that launched in September. Meanwhile, iPhone owners' devices continue to age, moving them closer to an eventual upgrade. UBS reported in March that the average age of an iPhone outside of China was a sky-high 37 months, pushing the limit of how long these customers will postpone the purchase of a new one. In other words, several bullish forces are likely to converge in 2026. The only matter that might give you pause here is the stock's recent run-up. We may be due for a small pullback, particularly if most other AI technology stocks take a corrective tumble. That could drag AAPL shares lower, too. Just don't get be too stingy. When Apple's firing on all cylinders, the stock doesn't remain on sale for too long. James Brumley has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Apple, IonQ, Nvidia, and Walmart. The Motley Fool has a disclosure policy . *Average returns of all recommendations since inception. Cost basis and return based on previous market day close. Related Articles Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2025 The Motley Fool . All rights reserved. Market data powered by Xignite and Polygon.io . About The Motley Fool Our Services Around the Globe Free Tools Affiliates & Friends"},
{"company": "AAPL", "title": "Prediction: These 2 AI Stocks Will Be Worth More Than Apple by Year-End 2026", "publisher": "Motley Fool", "link": "https://www.fool.com/investing/2025/11/23/predict-ai-stocks-worth-more-than-apple-2026/", "summary": "Apple is more expensive and growing slower than these other artificial intelligence (AI) stocks.", "time": "2025-11-23 23:30:00", "full_text": "Apple is more expensive and growing slower than these other artificial intelligence (AI) stocks. Apple ( AAPL +1.97% ) stock has done well this year, and it currently sports a $4 trillion market cap , making it the second-largest company in the world behind Nvidia ($4.4 trillion). Investors love the company behind the iPhone, iPad, and the entire Apple computing ecosystem that generates over $400 billion in revenue each year. However, if we look at the underlying earnings and growth of the business, it is clear that Apple stock is overvalued versus other \"Magnificent Seven\" companies. Here's the skinny on why Apple stock will be eclipsed by Alphabet ( GOOG +3.33% ) ( GOOGL +3.50% ) , with its $3.64 billion market cap, and Microsoft ( MSFT 1.32% ) , with its $3.53 trillion market cap, by year-end 2026 when it comes to total value. Alphabet -- the parent company behind Google, YouTube, and Google Cloud -- recently set a new bar in artificial intelligence ( AI ) capabilities with the launch of the Gemini 3 chatbot. Gemini 3 crushes the benchmarks in AI capabilities across language queries, image generation, and deep research. Even though OpenAI's ChatGPT has more users, Gemini is the best chatbot out there today, according to third-party analysts. Gemini is now powering AI overviews on Google search results, which management says already has 2 billion users every month. The Gemini app now has 650 million monthly active users (MAUs), making it one of the fastest-growing applications in the world, catching up to ChatGPT quickly. What's more, 70% of Google Cloud customers are utilizing Gemini, with 13 million developers building on the models. Not only can Alphabet monetize its AI capabilities through consumers, but by selling its capabilities through Google Cloud. Google Cloud revenue is growing 34% year over year, and while we don't have figures around Gemini's revenue growth, it is likely growing much faster. Overall, Alphabet revenue is now growing 15% in constant currency, and with healthy profit margins. With no end in sight to the growing demand for AI, I expect Alphabet's revenue to keep growing at a double-digit rate over the next few years. Image source: Getty Images. While Microsoft has lagged in developing consumer chatbots, it has perhaps been even better than Google Cloud at capturing AI contracts for its cloud computing division, Microsoft Azure. Azure has signed deals with AI start-ups competing with Google's Gemini, such as OpenAI and Anthropic, which come with huge sums of projected lifetime spending. For example, just this week, Anthropic cozied up to Azure and committed to buying $30 billion in credits on Azure. Last quarter, Azure revenue grew 39% year over year in constant currency , with overall cloud revenue up 27% to $30.9 billion, or run-rate revenues of $123.6 billion. Microsoft has plenty going for it with its Office suite of products, too. This revenue segment, which also includes LinkedIn, grew revenue 14% year over year last quarter to $33 billion. At such a large scale, Microsoft is now seeing huge amounts of operating leverage, with operating income of $38 billion last quarter on $77.7 billion in revenue, or a margin of 49%. Data by YCharts. When comparing both Microsoft and Alphabet to Apple, there are two metrics that show why the former stocks are better positioned than the latter to be larger in 2026: growth and price. Microsoft and Alphabet have grown much faster than Apple in recent history. Over the last three years, Microsoft's revenue has grown 44% and Alphabet's has grown 37% (cumulatively). Apple's is only up 7.4%. Apple has failed to innovate and bring out successful new products, especially in the AI space, that can drive growth for the business. In fact, it is rumored that the struggling Siri chatbot will be utilizing Gemini in the future, which Apple will be paying Alphabet $1 billion a year for the privilege of. Apple stock is also priced higher than Microsoft and Alphabet. Apple has a price-to-earnings ratio ( P/E ) of 36 compared to 34.5 for Microsoft and 29 for Alphabet. So not only is Apple growing slower than its Magnificent Seven peers, but doing so while trading at a higher valuation. I bet this paradigm flips in 2026, leading Microsoft and Alphabet to finish the year with larger market caps than Apple. Brett Schafer has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet, Apple, Microsoft, and Nvidia. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy . *Average returns of all recommendations since inception. Cost basis and return based on previous market day close. Related Articles Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2025 The Motley Fool . All rights reserved. Market data powered by Xignite and Polygon.io . About The Motley Fool Our Services Around the Globe Free Tools Affiliates & Friends"},
{"company": "AAPL", "title": "This Is My Favorite Warren Buffett Stock, and It's One of His Biggest Bets (Hint: It's Not Apple or Alphabet)", "publisher": "Motley Fool", "link": "https://www.fool.com/investing/2025/11/24/this-is-my-favorite-warren-buffett-stock-and-its-o/", "summary": "Consistently growing its earnings per share at robust double-digit rates, this stock is my favorite of Warren Buffett's investments.", "time": "2025-11-24 05:31:00", "full_text": "Consistently growing its earnings per share at robust double-digit rates, this stock is my favorite of Warren Buffett's investments. Berkshire Hathaway ( BRK.A +0.09% ) ( BRK.B +0.58% ) has turned a small group of companies into enormous bets over the past decade, and Apple ( AAPL +1.78% ) has dominated that list for years. Given Berkshire chairman and CEO Warren Buffett's successful track record with stocks, investors are often looking at the company's stock holdings -- especially its biggest ones -- to get investment ideas. And now a newly disclosed stake in Google parent Alphabet ( GOOG +3.33% ) ( GOOGL +3.53% ) has reinvigorated interest in Berkshire's investment moves. Apple still soaks up more than a fifth of Berkshire's stock portfolio, and Alphabet is now a top-10 position, even if it remains modest in dollar terms compared with the conglomerate's very largest holdings. But when I think about which Buffett stock I most want to ride with for the next decade, I keep coming back to a more old-fashioned name. American Express ( AXP +2.64% ) is Berkshire's second largest equity holding and one of its longest-tenured relationships. For me, it captures the heart of Buffett's approach: a durable franchise, advantaged economics, and a business capable of sending real cash back to owners in the form of dividends and share repurchases . Image source: Getty Images. As of the end of Q3, Berkshire owned 151.6 million American Express shares, valued at about $50 billion. That stake accounts for close to a fifth of Berkshire's equity portfolio, firmly entrenching American Express as Buffett's No. 2 holding behind Apple. Unlike the Apple position, which Berkshire has been trimming, the American Express stake has remained unchanged for decades. That kind of stability reflects the underlying business. American Express is a global payments company that issues cards, runs its own network, and works directly with merchants. Sitting on both sides of the transaction, it captures rich data on where and how card members spend, which helps the company target high-spending customers and refine rewards in ways rivals struggle to match. The company's last full calendar year demonstrates how powerful that model can be. In 2024, American Express's revenue rose 9% year over year to $65.9 billion, and earnings per share climbed 25% to $14.01. Additionally, management reported record card member spending, record fee revenue (the revenue the company collects from membership fees from its customers), and record new card acquisitions. During the same year, it returned $7.9 billion to shareholders through $5.9 billion of share repurchases and $2.0 billion of dividends. Recent quarters show that momentum has not faded. Second-quarter revenue grew 9% year over year, while earnings per share increased 17%. And third-quarter revenue growth accelerated to a rate of 11%. Earnings per share for the quarter also accelerated, rising 19% year over year. Benefitting the quarter was a refresh to its consumer and business Platinum cards in the U.S. \"The initial customer demand and engagement exceeded our expectations, with new U.S. Platinum account acquisitions doubling compared to pre-refresh levels,\" said American Express CEO Stephen Squeri in the company's third-quarter earnings release. The successful refresh of the platinum card speaks to the company's pricing power, as it commands an annual fee of $895 -- a fee members eagerly pay to get access to airport lounges and a long list of other perks, including credits for travel, clothes, dining, and more. And valuation is where American Express really stands out among Buffett's big bets. The stock has a price-to-earnings ratio of 24. While financial stocks often sport lower price-to-earnings multiples than stocks in other sectors, it's still notably below both Apple and Alphabet's price-to-earnings ratios of 36 and 30, respectively. Sure, American Express is not cheap compared with many traditional financial stocks, but that multiple looks more reasonable given its consistent double-digit revenue growth, strong credit performance, and shareholder-friendly capital returns. The risks, of course, are significant. A meaningful recession could slow card member spending and push credit losses higher, which would crimp earnings and reduce the company's ability to keep growing capital returns at the same pace. Further, competition from banks, buy-now-pay-later providers, and the big card networks remains intense. Overall, I believe the stock looks attractive despite these risks. Sure, shares could get hit pretty hard in a weak economy. So, anyone who buys the stock today should prepare for volatility and should maintain a long-term view. But I truly believe that, 10 years from now, hindsight will show this as one of Berkshire's best-performing stocks. American Express is an advertising partner of Motley Fool Money. Daniel Sparks and his clients have positions in Apple and Berkshire Hathaway. The Motley Fool has positions in and recommends Alphabet, Apple, and Berkshire Hathaway. The Motley Fool has a disclosure policy . *Average returns of all recommendations since inception. Cost basis and return based on previous market day close. Related Articles Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2025 The Motley Fool . All rights reserved. Market data powered by Xignite and Polygon.io . About The Motley Fool Our Services Around the Globe Free Tools Affiliates & Friends"},
{"company": "AAPL", "title": "How to plan Black Friday shopping to avoid overspending", "publisher": "Yahoo Finance UK", "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=3_cc-session_4dc9981e-a210-4102-ba9f-ee426e281727", "summary": "Beware of the deadly Black Friday mistakes, or you can end up wasting hundreds of pounds. Here's how you can be a savvy shopper.", "time": "2025-11-24 06:00:19", "full_text": "Yahoo is part of the Yahoo family of brands The sites and apps that we own and operate, including Yahoo, AOL, Engadget, In The Know and Makers. Yahoo family of brands. If you do not want us and our partners to use cookies and personal data for these additional purposes, click ' Reject all '. If you would like to customise your choices, click ' Manage privacy settings '. You can withdraw your consent or change your choices at any time by clicking on the 'Privacy & cookie settings' or 'Privacy dashboard' links on our sites and apps. Find out more about how we use your personal data in our privacy policy and cookie policy ."},
{"company": "AAPL", "title": "Everything you need to know about second charge mortgages", "publisher": "Yahoo Finance UK", "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=3_cc-session_f2545e73-7164-45c0-919b-44b0cc6c09b4", "summary": "This type of lending has increased dramatically in the last two years but what are the pros and cons?", "time": "2025-11-24 06:00:19", "full_text": "Yahoo is part of the Yahoo family of brands The sites and apps that we own and operate, including Yahoo, AOL, Engadget, In The Know and Makers. Yahoo family of brands. If you do not want us and our partners to use cookies and personal data for these additional purposes, click ' Reject all '. If you would like to customise your choices, click ' Manage privacy settings '. You can withdraw your consent or change your choices at any time by clicking on the 'Privacy & cookie settings' or 'Privacy dashboard' links on our sites and apps. Find out more about how we use your personal data in our privacy policy and cookie policy ."},
{"company": "AAPL", "title": "Young people lack skills to manage their money – but the UK curriculum is finally catching up", "publisher": "Yahoo Finance UK", "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=3_cc-session_4f9c574f-91c0-404f-a61a-418c071c8e14", "summary": "The UK government’s updated curriculum places a far stronger emphasis on financial learning from an early age.", "time": "2025-11-24 06:00:24", "full_text": "Yahoo is part of the Yahoo family of brands The sites and apps that we own and operate, including Yahoo, AOL, Engadget, In The Know and Makers. Yahoo family of brands. If you do not want us and our partners to use cookies and personal data for these additional purposes, click ' Reject all '. If you would like to customise your choices, click ' Manage privacy settings '. You can withdraw your consent or change your choices at any time by clicking on the 'Privacy & cookie settings' or 'Privacy dashboard' links on our sites and apps. Find out more about how we use your personal data in our privacy policy and cookie policy ."},
{"company": "AAPL", "title": "Dow Jones Futures, Bitcoin Rise; Nvidia, Apple, Eli Lilly In Focus", "publisher": "Investor's Business Daily", "link": "https://www.investors.com/market-trend/stock-market-today/dow-jones-futures-bitcoin-nvidia-apple-eli-lilly/?src=A00220&yptr=yahoo", "summary": "The stock market needs to show a lot of strength after damaging recent losses. Watch Nvidia, Apple and Eli Lilly.", "time": "2025-11-24 04:05:03", "full_text": "BREAKING: Futures Rise, Bitcoin Rebounds Dow Jones futures rose Sunday night, along with S&P 500 futures and Nasdaq futures, while Bitcoin rebounded. The stock market suffered significant losses this past week, with the major indexes breaking below key levels, despite strong Nvidia (NVDA) earnings. Stocks bounced Friday on renewed Fed rate cut hopes and Nvidia chip sales to China, though gains faded. Growth names suffered… 11/22/2025 Many AI stocks have retreated from 52-week or record highs. What's clear is that investor worries over an AI bubble... 11/22/2025 Many AI stocks have retreated from 52-week or record highs.... The antibody drug conjugates market could be worth north of $32 billion by 2033, according to Grand View Research. (© Dave Cutler) Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Information in Investor’s Business Daily is for informational and educational purposes only and should not be construed as an offer, recommendation, solicitation, or rating to buy or sell securities. The information has been obtained from sources we believe to be reliable, but we make no guarantee as to its accuracy, timeliness, or suitability, including with respect to information that appears in closed captioning. Historical investment performances are no indication or guarantee of future success or performance. Authors/presenters may own the stocks they discuss. We make no representations or warranties regarding the advisability of investing in any particular securities or utilizing any specific investment strategies. Information is subject to change without notice. For information on use of our services, please see our Terms of Use . *Real-time prices by Nasdaq Last Sale. Real-time quote and/or trade prices are not sourced from all markets. Ownership data provided by LSEG and Estimate data provided by FactSet. IBD, IBD Digital, IBD Live, IBD Weekly, Investor's Business Daily, Leaderboard, MarketDiem, MarketSurge and other marks are trademarks owned by Investor's Business Daily, LLC. ©2025 Investor’s Business Daily, LLC. All Rights Reserved."}
]