[
{"company": "AAPL", "title": "Apple’s presumptive future CEO, John Ternus, has a tough act to follow", "publisher": "Yahoo Finance", "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=3_cc-session_f8c4b818-fd2a-4ca3-931d-681d3814b263", "summary": "Replacing Tim Cook, who has been at Apple since Steve Jobs hired him in 1998, will be a tall task.", "time": "2025-11-22 15:34:13", "full_text": "Yahoo fait partie de la famille de marques Famille de marques Yahoo Les sites et applications que nous possédons et exploitons, notamment Yahoo, AOL, Engadget, In The Know et Makers. Yahoo . Si vous ne souhaitez pas que nos partenaires et nous–mêmes utilisions des cookies et vos données personnelles pour ces motifs supplémentaires, cliquez sur Refuser tout . Si vous souhaitez personnaliser vos choix, cliquez sur Gérer les paramètres de confidentialité . Vous pouvez révoquer votre consentement ou modifier vos choix à tout moment en cliquant sur les liens « Paramètres de confidentialité et des cookies » ou « Tableau de bord sur la confidentialité » présents sur nos sites et dans nos applications. Découvrez comment nous utilisons vos données personnelles dans notre Politique de confidentialité et notre Politique concernant les cookies ."},
{"company": "TSLA", "title": "I Would Buy Tesla Stock at This Price", "publisher": "Motley Fool", "link": "https://www.fool.com/investing/2025/11/24/i-would-buy-tesla-stock-at-this-price/", "summary": "Tesla is a remarkable company with great prospects. But price matters.", "time": "2025-11-24 08:31:00", "full_text": "Tesla is a remarkable company with great prospects. But price matters. Tesla ( TSLA 1.05% ) is a fascinating business. The electric-vehicle and energy company is pushing into autonomous ride-sharing and humanoid robots while still ramping its core electric vehicle and energy storage operations. I admire what Tesla is building and expect the company to be extremely successful over time. But valuation is a critical part of investing -- and at today's price, the stock already bakes significant growth for years to come, leaving very little margin of safety if the company's growth plans take longer than expected or if expanding into these new business lines costs more than anticipated. With this backdrop in mind, I'd buy into the story -- but only at the right price. Tesla's unreleased Cybercab vehicle. Image source: Tesla. After a sluggish first half of 2025, Tesla returned to double-digit revenue growth in Q3. Total revenue for the period reached $28.1 billion, a 12% increase year over year, driven by record vehicle deliveries and strong demand for large-scale energy storage projects. Automotive revenue rose 6% year over year to about $21.2 billion, while the energy generation and storage segment grew revenue 44% to roughly $3.4 billion as deployments reached 12.5 gigawatt-hours. The company delivered more than 497,000 vehicles in the quarter. Profitability, however, told a different story. Third-quarter operating income fell 40% year over year to $1.6 billion, and operating margin dropped to 5.8% from 10.8% a year earlier. Operating expenses increased by 50% to approximately $3.4 billion, as the company invested heavily in artificial intelligence infrastructure and new product development. As of this writing, the stock has a price-to-earnings ratio of about 270 and trades at about 14 times sales. Those are demanding multiples for a company that still earns most of its revenue from selling vehicles. And even if investors expect Tesla to look more like a high-margin software and services platform over time, today's valuation already prices this in. In the meantime, Tesla's business remains capital-intensive. But management hopes high-margin businesses -- self-driving software sales and an autonomous ride-sharing network -- can help the company transform into a technology company with tech company -like margins. Then there's Tesla's plans for humanoid robots, but it's unclear what kind of margins it can achieve in such an unprecedented business. The problem? Each of Tesla's growth initiatives will require significant sums of capital to scale. In addition, there's timing risk. These growth initiatives carry technical and regulatory risk that could delay commercialization. Investors can already see the strain. Operating expenses in the third quarter rose much faster than revenue. That kind of spending is understandable for a company that believes it has an opportunity of unusual size. But does the stock's valuation leave enough room for the risks associated with building out these new product initiatives? At a price that values Tesla well over 250 times current earnings and about 170 times forward earnings , even modest setbacks in autonomy timelines or vehicle demand could create sharp swings in the stock. That is why my own discipline points to a lower entry point. I believe that at around $220 per share, the stock would still carry a valuation that reflects Tesla's position in electric vehicles and its growth opportunities in higher-margin businesses. Of course, this doesn't mean investors should sell shares they already own. Extreme volatility is part of owning a stock with so much future potential baked in. So it's normal for shares to trade in a wide band. In addition, given Tesla's long history of incredible growth, the company could very well exceed even my most optimistic expectations. Still, I'm happy to admire the business from the sidelines and keep my buy price near $220, for now. This, of course, is a moving target that may very well move up over time as I get new information about Tesla's ever-expanding business. While there's no guarantee shares actually fall to this price, I'll be ready if they do. In the meantime, I'll take new capital elsewhere. Daniel Sparks and/or his clients have positions in Tesla. The Motley Fool has positions in and recommends Tesla. The Motley Fool has a disclosure policy . *Average returns of all recommendations since inception. Cost basis and return based on previous market day close. Related Articles Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2025 The Motley Fool . All rights reserved. Market data powered by Xignite and Polygon.io . About The Motley Fool Our Services Around the Globe Free Tools Affiliates & Friends"},
{"company": "AAPL", "title": "Dow Jones Futures, Bitcoin Rise; Nvidia, Apple, Eli Lilly In Focus", "publisher": "Investor's Business Daily", "link": "https://www.investors.com/market-trend/stock-market-today/dow-jones-futures-bitcoin-nvidia-apple-eli-lilly/?src=A00220&yptr=yahoo", "summary": "The stock market needs to show a lot of strength after damaging recent losses. Watch Nvidia, Apple and Eli Lilly.", "time": "2025-11-24 04:05:03", "full_text": "BREAKING: Futures Rise; Google, Novo Nordisk Early Movers Dow Jones futures rose modestly early Monday, along with S&P 500 futures and Nasdaq futures. Bitcoin rose vs. Friday but was off Sunday highs. The stock market suffered significant losses this past week, with the major indexes breaking below key levels, despite strong Nvidia (NVDA) earnings. Stocks bounced Friday on renewed Fed rate cut hopes and Nvidia chip sales to… 11/24/2025 Futures rose Monday. Google popped amid Salesforce CEO Marc Benioff's praise for AI model Gemini 3. Novo Nordisk dived on... 11/24/2025 Futures rose Monday. Google popped amid Salesforce CEO Marc Benioff's... The antibody drug conjugates market could be worth north of $32 billion by 2033, according to Grand View Research. (© Dave Cutler) Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Information in Investor’s Business Daily is for informational and educational purposes only and should not be construed as an offer, recommendation, solicitation, or rating to buy or sell securities. The information has been obtained from sources we believe to be reliable, but we make no guarantee as to its accuracy, timeliness, or suitability, including with respect to information that appears in closed captioning. Historical investment performances are no indication or guarantee of future success or performance. Authors/presenters may own the stocks they discuss. We make no representations or warranties regarding the advisability of investing in any particular securities or utilizing any specific investment strategies. Information is subject to change without notice. For information on use of our services, please see our Terms of Use . *Real-time prices by Nasdaq Last Sale. Real-time quote and/or trade prices are not sourced from all markets. Ownership data provided by LSEG and Estimate data provided by FactSet. IBD, IBD Digital, IBD Live, IBD Weekly, Investor's Business Daily, Leaderboard, MarketDiem, MarketSurge and other marks are trademarks owned by Investor's Business Daily, LLC. ©2025 Investor’s Business Daily, LLC. All Rights Reserved."},
{"company": "TSLA", "title": "Nvidia's, Alphabet, Tesla's and Meta are part of Zacks Earnings Preview", "publisher": "Zacks", "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=3_cc-session_50c2a6cf-509c-4256-aef4-0cc79e0d6caf", "summary": "Nvidia's, Alphabet, Tesla's and Meta have been highlighted in this Earnings Preview article.", "time": "2025-11-24 10:05:00", "full_text": "Yahoo fait partie de la famille de marques Famille de marques Yahoo Les sites et applications que nous possédons et exploitons, notamment Yahoo, AOL, Engadget, In The Know et Makers. Yahoo . Si vous ne souhaitez pas que nos partenaires et nous–mêmes utilisions des cookies et vos données personnelles pour ces motifs supplémentaires, cliquez sur Refuser tout . Si vous souhaitez personnaliser vos choix, cliquez sur Gérer les paramètres de confidentialité . Vous pouvez révoquer votre consentement ou modifier vos choix à tout moment en cliquant sur les liens « Paramètres de confidentialité et des cookies » ou « Tableau de bord sur la confidentialité » présents sur nos sites et dans nos applications. Découvrez comment nous utilisons vos données personnelles dans notre Politique de confidentialité et notre Politique concernant les cookies ."},
{"company": "TSLA", "title": "Safe, Routine, Ready: Does That Spell the End for Tesla's Run-Up?", "publisher": "Motley Fool", "link": "https://www.fool.com/investing/2025/11/24/safe-routine-ready-does-that-spell-the-end-for-tes/", "summary": "Tesla's stock has surged higher in recent months off of robotaxi hype, but this development could have investors pumping the brakes.", "time": "2025-11-24 09:27:00", "full_text": "Tesla's stock has surged higher in recent months off of robotaxi hype, but this development could have investors pumping the brakes. Tesla ( TSLA 1.05% ) shares have been on a wild ride in 2025 with investors engaged in a tug of war of sorts, between bears and bulls. The bears base their position in reality, a reality where Tesla sales and profits are in decline and its vehicle lineup is aging. The bulls base their position in a potentially lucrative future based around artificial intelligence (AI), robotics , and robotaxis . Right now, the bulls are winning with Tesla stock up 28% over the past three months, but here's why investors might want to pump the brakes a bit. \"Safe, routine, ready: Autonomous driving in new cities\" are the words that should have Tesla investors pumping the brakes on the potentially lucrative future they envisioned for the electric vehicle (EV) maker. That's because direct competitor Waymo is shifting its expansion into a higher gear: \"We've built a generalizable Driver, powered by Waymo's demonstrably safe AI, and an operational playbook to reliably achieve this milestone,\" said Tekedra Mawakana, Waymo's co-CEO, on the expansion, according to Electrek. This week, Waymo announced fully autonomous driving in five new cities: Miami, Dallas, Houston, San Antonio, and Orlando. Operations started in Miami this week and will begin in the remaining four cities in the coming weeks, although it's important to note that doors for riders won't open until next year. This goes with Waymo's recent playbook to test for a few months before opening the app to the public. It's also important for investors to grasp the lead that Waymo may have developed over the past few years. For instance, Tesla is currently testing its initial robotaxi operations in Austin, Texas, with roughly 30 robotaxis in operation and plans to expand the fleet to about 500 by the end of the year. Tesla is still using a safety monitor, which Waymo removed in 2020, but has plans to transition to fully driverless operation by the end of the year. Tesla Cybercab. Image source: Tesla. The five new cities that Waymo is entering will bring its total city count to 10 at a time when Tesla just announced it obtained a permit to operate a ride-hailing service in Arizona. It's definitely a step forward for Tesla, although additional permits will be required before the automaker can operate a full robotaxi service in the state. When Tesla enters the Phoenix, Arizona market next year, it will already trail Waymo's operations in the city, which boasts at least 400 autonomous vehicles. In fact, Waymo said it has already surpassed 10 million driverless trips served to riders across its U.S. operations. Despite Tesla playing catch up to rival Waymo, Tesla investors have some reason to be optimistic. Tesla could very well develop a competitive advantage in scaling a robotaxi business thanks to access to a plethora of Tesla vehicles on the road and its production capacity. Furthermore, Tesla's strategic rollout could be more scalable as the company is relying on a camera-based system rather than LiDAR and radar, which competitors are using. Tesla shareholders also made it clear where they want CEO Elon Musk's focus. Musk's new compensation package, worth up to $1 trillion, was approved by 75% of voters but with milestones tied to future endeavors. Musk will still have to build cars for some of his rewards, have 1 million robotaxis in commercial operation, 1 million Optimus robots, and 10 million Full Self-Driving subscriptions. These goals suggest the company is pivoting its core business from automotive manufacturer to a more tech-centric company. Tesla's best days may very well be ahead of it. It's already proven many naysayers wrong by making it this far, but it's important for investors to pump the brakes on robotaxi hype, because not only is Tesla playing catch up to Waymo; the future of robotaxis is more uncertain thanks to evolving regulations, lawsuits, and safety concerns. Investors need to understand what company they're investing in moving forward, given Tesla's lofty valuation and price-to-earnings (P/E) ratio approaching 300 times, and a market capitalization more than 10 times Ford and GM combined. Daniel Miller has positions in Ford Motor Company and General Motors. The Motley Fool has positions in and recommends Tesla. The Motley Fool recommends General Motors. The Motley Fool has a disclosure policy . *Average returns of all recommendations since inception. Cost basis and return based on previous market day close. Related Articles Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2025 The Motley Fool . All rights reserved. Market data powered by Xignite and Polygon.io . About The Motley Fool Our Services Around the Globe Free Tools Affiliates & Friends"},
{"company": "TSLA", "title": "Billionaire Philippe Laffont Is Selling CoreWeave, Tesla, and Nvidia and Piling Into 2 Recent IPOs", "publisher": "Motley Fool", "link": "https://www.fool.com/investing/2025/11/24/billionaire-phillipe-laffont-sell-coreweave-tesla/", "summary": "Philippe Laffont is renowned for being an early investor in several of the world's most disruptive and prominent tech giants.", "time": "2025-11-24 11:45:00", "full_text": "Philippe Laffont is renowned for being an early investor in several of the world's most disruptive and prominent tech giants. Billionaire Philippe Laffont is a tiger cub, meaning he's part of an elite group of investors who worked for Julian Robertson's Tiger Global Management in the 1990s and then went on to found his own fund, Coatue Management. Laffont made early investments in TikTok's parent company ByteDance, Snap , Tesla , Meta Platforms , and Spotify , among others. Needless to say, Laffont can typically spot the big tech trends before they happen, which is why investors are always so eager to get a glimpse into Coatue's portfolio each quarter. In the third quarter, Coatue trimmed its positions in CoreWeave ( CRWV +3.53% ) , Tesla, and Nvidia ( NVDA 1.06% ) , and invested in two recent initial public offerings. Image source: Getty Images. Coatue appeared to follow the broader institutional investor landscape in the quarter, reducing its stake in several prominent artificial intelligence (AI) companies . Coatue sold 62% of its position in the AI data center company CoreWeave, 15% of its position in the electric vehicle and robotaxi company Tesla, and 14% of its position in the AI chip giant Nvidia. In recent months, investors have become increasingly concerned about AI valuations, which have long been high, as well as the macroeconomic environment, with investors penciling in a smaller chance of another interest rate cut by the Federal Reserve in December. Furthermore, other AI concerns have emerged, including the large amounts of money the hyperscalers are spending to build out AI infrastructure, which is expected to be in the trillions over the next five years. Other well-known investors like Michael Burry have been more outspoken on social media regarding concerns over how large AI companies like Oracle and Meta Platforms are accounting for depreciation of semiconductors and servers, specifically as they extend the useful life of them, despite uncertainty about how long they will really last. Other broader concerns that are coming into the spotlight are whether the U.S. can generate enough electricity to meet the demand for AI. Manufacturing AI chips also requires significant water usage, another issue related to the amount of resources needed to power AI. Ultimately, it's difficult to predict what will happen next in terms of whether this marks the beginning of a pullback or a buy-the-dip opportunity. I don't think AI is about to become irrelevant, but the sector's path is unclear. Investors should be long-term-focused, and in my view, try to avoid some of the higher valuations out there, such as Tesla's. On its third-quarter 13F filing, Coatue reported positions in both the buy-now-pay-later (BNPL) company Klarna ( KLAR +3.42% ) and the collaborative design tech company Figma ( FIG +2.20% ) , both of which were high-profile IPOs this year. Figma went public with tremendous hype, opening at $33 per share and rising to a high of $143 per share, although it would be short-lived. The company essentially provides a Google Docs-like workflow for designers and coders to collaborate on a range of projects, allowing multiple people to work on designs that can be easily translated into code for website or app implementation. The company also has AI components and is being integrated as a third party into ChatGPT. Coatue actually got involved in the company prior to the IPO, investing in it in 2024 at a $12.5 billion valuation. While selling the stock immediately following the IPO and the huge jump would have been a no-brainer, IPOs often contain lock-up provisions preventing this practice. At the end of the third quarter, Coatue held over 3.2 million shares. Investors should still likely be wary of the stock, which has come down significantly after the initial IPO pop. Even at its current $18 billion market cap, Figma is still unprofitable and trades at over 17 times forward revenue . Coatue also reported owning 330,000 shares of Klarna at the end of the third quarter. I haven't found any evidence that Coatue ever participated in a private financing round of Klarna prior to this report, although it's certainly possible. However, it's also possible that Coatue recently scooped up shares. Klarna's IPO also started hot, but has since fallen below its IPO price. Klarna trades at a more reasonable valuation than Figma, at about 4 times forward revenue, but its losses have also risen significantly. BNPL companies are heavily impacted by the health of the consumer and the economy, so while the company has potential to disrupt the credit card space, I am still cautious on Klarna at this valuation. Bram Berkowitz has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Klarna Group, Meta Platforms, Nvidia, Oracle, Spotify Technology, and Tesla. The Motley Fool has a disclosure policy . *Average returns of all recommendations since inception. Cost basis and return based on previous market day close. Related Articles Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2025 The Motley Fool . All rights reserved. Market data powered by Xignite and Polygon.io . About The Motley Fool Our Services Around the Globe Free Tools Affiliates & Friends"},
{"company": "TSLA", "title": "Tesla hits out at Brussels over delays to self-driving cars", "publisher": "The Telegraph", "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=3_cc-session_e996c5aa-6256-4d92-ba2a-6615f40d1e9b", "summary": "Tesla has accused Brussels of delaying the launch of self-driving cars across Europe.", "time": "2025-11-24 12:35:57", "full_text": "Yahoo is part of the Yahoo family of brands The sites and apps that we own and operate, including Yahoo, AOL, Engadget, In The Know and Makers. Yahoo family of brands. If you do not want us and our partners to use cookies and personal data for these additional purposes, click ' Reject all '. If you would like to customise your choices, click ' Manage privacy settings '. You can withdraw your consent or change your choices at any time by clicking on the 'Privacy & cookie settings' or 'Privacy dashboard' links on our sites and apps. Find out more about how we use your personal data in our privacy policy and cookie policy ."},
{"company": "TSLA", "title": "Here’s Why Tesla (TSLA) Surged in Q3", "publisher": "Insider Monkey", "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=3_cc-session_fb46a1c1-207b-45f9-83d8-20e69c50fb99", "summary": "Loomis Sayles, an investment management company, released its “Global Growth Fund” investor letter for the third quarter of 2025. A copy of the letter can be downloaded here. In the third quarter, the fund returned 7.59% compared to 7.62% for the MSCI ACWI Index Net. The firm seeks to invest in high-quality businesses that possess […]", "time": "2025-11-24 13:32:34", "full_text": "Yahoo fait partie de la famille de marques Famille de marques Yahoo Les sites et applications que nous possédons et exploitons, notamment Yahoo, AOL, Engadget, In The Know et Makers. Yahoo . Si vous ne souhaitez pas que nos partenaires et nous–mêmes utilisions des cookies et vos données personnelles pour ces motifs supplémentaires, cliquez sur Refuser tout . Si vous souhaitez personnaliser vos choix, cliquez sur Gérer les paramètres de confidentialité . Vous pouvez révoquer votre consentement ou modifier vos choix à tout moment en cliquant sur les liens « Paramètres de confidentialité et des cookies » ou « Tableau de bord sur la confidentialité » présents sur nos sites et dans nos applications. Découvrez comment nous utilisons vos données personnelles dans notre Politique de confidentialité et notre Politique concernant les cookies ."},
{"company": "TSLA", "title": "Tesla Declares War on AI Chip Giants -- Elon Musk Vows Yearly Breakthroughs", "publisher": "GuruFocus.com", "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=3_cc-session_0a23be60-6b55-44da-ab39-f34b27e6eee7", "summary": "Elon Musk's Bold AI Gamble: Tesla Aims to Outproduce All Rivals Combined", "time": "2025-11-24 13:33:48", "full_text": "Yahoo fait partie de la famille de marques Famille de marques Yahoo Les sites et applications que nous possédons et exploitons, notamment Yahoo, AOL, Engadget, In The Know et Makers. Yahoo . Si vous ne souhaitez pas que nos partenaires et nous–mêmes utilisions des cookies et vos données personnelles pour ces motifs supplémentaires, cliquez sur Refuser tout . Si vous souhaitez personnaliser vos choix, cliquez sur Gérer les paramètres de confidentialité . Vous pouvez révoquer votre consentement ou modifier vos choix à tout moment en cliquant sur les liens « Paramètres de confidentialité et des cookies » ou « Tableau de bord sur la confidentialité » présents sur nos sites et dans nos applications. Découvrez comment nous utilisons vos données personnelles dans notre Politique de confidentialité et notre Politique concernant les cookies ."},
{"company": "AAPL", "title": "This Is My Favorite Warren Buffett Stock, and It's One of His Biggest Bets (Hint: It's Not Apple or Alphabet)", "publisher": "Motley Fool", "link": "https://www.fool.com/investing/2025/11/24/this-is-my-favorite-warren-buffett-stock-and-its-o/", "summary": "Consistently growing its earnings per share at robust double-digit rates, this stock is my favorite of Warren Buffett's investments.", "time": "2025-11-24 05:31:00", "full_text": "Consistently growing its earnings per share at robust double-digit rates, this stock is my favorite of Warren Buffett's investments. Berkshire Hathaway ( BRK.A +0.09% ) ( BRK.B +0.48% ) has turned a small group of companies into enormous bets over the past decade, and Apple ( AAPL +1.97% ) has dominated that list for years. Given Berkshire chairman and CEO Warren Buffett's successful track record with stocks, investors are often looking at the company's stock holdings -- especially its biggest ones -- to get investment ideas. And now a newly disclosed stake in Google parent Alphabet ( GOOG +3.33% ) ( GOOGL +3.50% ) has reinvigorated interest in Berkshire's investment moves. Apple still soaks up more than a fifth of Berkshire's stock portfolio, and Alphabet is now a top-10 position, even if it remains modest in dollar terms compared with the conglomerate's very largest holdings. But when I think about which Buffett stock I most want to ride with for the next decade, I keep coming back to a more old-fashioned name. American Express ( AXP +2.64% ) is Berkshire's second largest equity holding and one of its longest-tenured relationships. For me, it captures the heart of Buffett's approach: a durable franchise, advantaged economics, and a business capable of sending real cash back to owners in the form of dividends and share repurchases . Image source: Getty Images. As of the end of Q3, Berkshire owned 151.6 million American Express shares, valued at about $50 billion. That stake accounts for close to a fifth of Berkshire's equity portfolio, firmly entrenching American Express as Buffett's No. 2 holding behind Apple. Unlike the Apple position, which Berkshire has been trimming, the American Express stake has remained unchanged for decades. That kind of stability reflects the underlying business. American Express is a global payments company that issues cards, runs its own network, and works directly with merchants. Sitting on both sides of the transaction, it captures rich data on where and how card members spend, which helps the company target high-spending customers and refine rewards in ways rivals struggle to match. The company's last full calendar year demonstrates how powerful that model can be. In 2024, American Express's revenue rose 9% year over year to $65.9 billion, and earnings per share climbed 25% to $14.01. Additionally, management reported record card member spending, record fee revenue (the revenue the company collects from membership fees from its customers), and record new card acquisitions. During the same year, it returned $7.9 billion to shareholders through $5.9 billion of share repurchases and $2.0 billion of dividends. Recent quarters show that momentum has not faded. Second-quarter revenue grew 9% year over year, while earnings per share increased 17%. And third-quarter revenue growth accelerated to a rate of 11%. Earnings per share for the quarter also accelerated, rising 19% year over year. Benefitting the quarter was a refresh to its consumer and business Platinum cards in the U.S. \"The initial customer demand and engagement exceeded our expectations, with new U.S. Platinum account acquisitions doubling compared to pre-refresh levels,\" said American Express CEO Stephen Squeri in the company's third-quarter earnings release. The successful refresh of the platinum card speaks to the company's pricing power, as it commands an annual fee of $895 -- a fee members eagerly pay to get access to airport lounges and a long list of other perks, including credits for travel, clothes, dining, and more. And valuation is where American Express really stands out among Buffett's big bets. The stock has a price-to-earnings ratio of 24. While financial stocks often sport lower price-to-earnings multiples than stocks in other sectors, it's still notably below both Apple and Alphabet's price-to-earnings ratios of 36 and 30, respectively. Sure, American Express is not cheap compared with many traditional financial stocks, but that multiple looks more reasonable given its consistent double-digit revenue growth, strong credit performance, and shareholder-friendly capital returns. The risks, of course, are significant. A meaningful recession could slow card member spending and push credit losses higher, which would crimp earnings and reduce the company's ability to keep growing capital returns at the same pace. Further, competition from banks, buy-now-pay-later providers, and the big card networks remains intense. Overall, I believe the stock looks attractive despite these risks. Sure, shares could get hit pretty hard in a weak economy. So, anyone who buys the stock today should prepare for volatility and should maintain a long-term view. But I truly believe that, 10 years from now, hindsight will show this as one of Berkshire's best-performing stocks. American Express is an advertising partner of Motley Fool Money. Daniel Sparks and his clients have positions in Apple and Berkshire Hathaway. The Motley Fool has positions in and recommends Alphabet, Apple, and Berkshire Hathaway. The Motley Fool has a disclosure policy . *Average returns of all recommendations since inception. Cost basis and return based on previous market day close. Related Articles Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2025 The Motley Fool . All rights reserved. Market data powered by Xignite and Polygon.io . About The Motley Fool Our Services Around the Globe Free Tools Affiliates & Friends"},
{"company": "AAPL", "title": "How to plan Black Friday shopping to avoid overspending", "publisher": "Yahoo Finance UK", "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=3_cc-session_c9e9bf78-4938-4883-8e3d-1d6a98eee7fd", "summary": "Beware of the deadly Black Friday mistakes, or you can end up wasting hundreds of pounds. Here's how you can be a savvy shopper.", "time": "2025-11-24 06:00:19", "full_text": "Yahoo is part of the Yahoo family of brands The sites and apps that we own and operate, including Yahoo, AOL, Engadget, In The Know and Makers. Yahoo family of brands. If you do not want us and our partners to use cookies and personal data for these additional purposes, click ' Reject all '. If you would like to customise your choices, click ' Manage privacy settings '. You can withdraw your consent or change your choices at any time by clicking on the 'Privacy & cookie settings' or 'Privacy dashboard' links on our sites and apps. Find out more about how we use your personal data in our privacy policy and cookie policy ."},
{"company": "AAPL", "title": "Everything you need to know about second charge mortgages", "publisher": "Yahoo Finance UK", "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=3_cc-session_52b44e70-071c-4cb2-9d4f-5eda24a70a49", "summary": "This type of lending has increased dramatically in the last two years but what are the pros and cons?", "time": "2025-11-24 06:00:19", "full_text": "Yahoo is part of the Yahoo family of brands The sites and apps that we own and operate, including Yahoo, AOL, Engadget, In The Know and Makers. Yahoo family of brands. If you do not want us and our partners to use cookies and personal data for these additional purposes, click ' Reject all '. If you would like to customise your choices, click ' Manage privacy settings '. You can withdraw your consent or change your choices at any time by clicking on the 'Privacy & cookie settings' or 'Privacy dashboard' links on our sites and apps. Find out more about how we use your personal data in our privacy policy and cookie policy ."},
{"company": "AAPL", "title": "Young people lack skills to manage their money – but the UK curriculum is finally catching up", "publisher": "Yahoo Finance UK", "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=3_cc-session_40063eee-ee0c-467b-ad2a-446577c5f5f0", "summary": "The UK government’s updated curriculum places a far stronger emphasis on financial learning from an early age.", "time": "2025-11-24 06:00:24", "full_text": "Yahoo is part of the Yahoo family of brands The sites and apps that we own and operate, including Yahoo, AOL, Engadget, In The Know and Makers. Yahoo family of brands. If you do not want us and our partners to use cookies and personal data for these additional purposes, click ' Reject all '. If you would like to customise your choices, click ' Manage privacy settings '. You can withdraw your consent or change your choices at any time by clicking on the 'Privacy & cookie settings' or 'Privacy dashboard' links on our sites and apps. Find out more about how we use your personal data in our privacy policy and cookie policy ."},
{"company": "AAPL", "title": "Prediction: Taiwan Semiconductor Will Be Worth More Than Apple by 2030", "publisher": "Motley Fool", "link": "https://www.fool.com/investing/2025/11/24/prediction-taiwan-semicondcutor-will-be-worth-more/", "summary": "The AI megatrend is benefiting Taiwan Semiconductor in a big way.", "time": "2025-11-24 12:00:00", "full_text": "The AI megatrend is benefiting Taiwan Semiconductor in a big way. At the time of this writing, Apple ( AAPL +1.97% ) is the world's second-largest company by market cap, with a $4 trillion valuation. So, predicting that a much smaller company like Taiwan Semiconductor Manufacturing ( TSM 0.96% ) can grow to become larger than Apple is a bold claim, especially when you consider that Taiwan Semi is a $1.4 trillion company right now. However, after looking at growth rates for the industries in which it's involved, I think Taiwan Semiconductor can achieve this feat, making it an incredible stock pick over the next few years. I think Taiwan Semi could grow to become a larger company than Apple by 2030, but it's going to need a lot of help to accomplish that goal. Image source: Getty Images. Apple doesn't need a lot of introduction. It's a leader in consumer electronics, and there's a good chance that this article is being read from an Apple-powered device. But therein lies the largest issue with Apple: market saturation. Apple has failed to grow revenue at a meaningful pace over the past few years, and it has only had one reported quarter of double-digit revenue growth since mid-2022 (and it only achieved that mark if you round up). AAPL Revenue (Quarterly YoY Growth) data by YCharts Apple has done a great job repurchasing shares and decreasing expenses, which has allowed its diluted earnings per share (EPS) to grow in the low-double-digit range. As a result, we'll use 12% as Apple's long-term EPS growth rate. For Taiwan Semiconductor, it's at the heart of the artificial intelligence (AI) race. Its chips are being used in nearly every high-powered AI computing device, ranging from Nvidia graphics processing units (GPUs) to custom AI accelerators from Broadcom . Furthermore, Taiwan Semiconductor is launching new chip technology that promises to improve energy consumption by 25% to 30% when configured for the same speed as previous generations. That's game-changing technology, and allows TSMC to charge a premium for those chips. Furthermore, there are no signs of the AI race slowing down. The other day, AMD released its projection that it expects its data center division to grow revenue at a 60% compound annual growth rate (CAGR) through 2030. That aligns well with a previous projection given by Nvidia, where global data center capital expenditures are expected to rise from $600 billion in 2025 to between $3 trillion and $4 trillion by 2030. That indicates a 42% CAGR at the midpoint, showcasing that TSMC's chip business can easily grow at that rate as well. During Q3, Taiwan Semiconductor's revenue rose 41% in U.S. dollars, aligning with the broader market growth. That aligned with TSMC's net income growth as well, so I'll use a 40% EPS growth rate for this projection. While that may seem like an aggressive assumption, it's what's required for TSMC to surpass Apple in market share by 2030. If the AI data center market is as large as the AMD and Nvidia projections, then this assumption may not be unreasonable. If Apple can grow its EPS by 12% throughout 2030 and Taiwan Semiconductor's rises by 40%, that would result in Apple having $13.52 in diluted EPS by the end of 2030 and Taiwan Semiconductor having a jaw-dropping $57.08. That's a substantial increase from today's values. AAPL EPS Diluted (TTM) data by YCharts To find out how much that would be worth for each company, we need to multiply the EPS figure by the total number of shares outstanding. Then, we'll have to assign it an earnings multiple. Using today's valuation figures (Apple at 36 times earnings and Taiwan Semiconductor at 28), that would give Apple a market cap of $7.2 trillion and Taiwan Semiconductor a market cap of $8.3 trillion by 2030. Will that happen? I'm not sure. Those are massive growth assumptions baked into Taiwan Semiconductor's stock that may not pan out. But if they do, I think it has a strong chance of surpassing Apple in market cap by 2030. Keithen Drury has positions in Broadcom, Nvidia, and Taiwan Semiconductor Manufacturing. The Motley Fool has positions in and recommends Advanced Micro Devices, Apple, Nvidia, and Taiwan Semiconductor Manufacturing. The Motley Fool recommends Broadcom. The Motley Fool has a disclosure policy . *Average returns of all recommendations since inception. Cost basis and return based on previous market day close. Related Articles Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2025 The Motley Fool . All rights reserved. Market data powered by Xignite and Polygon.io . About The Motley Fool Our Services Around the Globe Free Tools Affiliates & Friends"},
{"company": "AAPL", "title": "Fubon expects the first foldable iPhone to cost $2,399", "publisher": "Investing.com", "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=3_cc-session_81313988-81d6-4b38-adb9-4496ee4773f4", "summary": "Investing.com -- Global smartphone demand is set to contract again in 2026, but foldables, and especially Apple’s long-anticipated entry, will provide a rare bright spot, according to a note from Fubon Research.", "time": "2025-11-24 13:46:12", "full_text": "Yahoo fait partie de la famille de marques Famille de marques Yahoo Les sites et applications que nous possédons et exploitons, notamment Yahoo, AOL, Engadget, In The Know et Makers. Yahoo . Si vous ne souhaitez pas que nos partenaires et nous–mêmes utilisions des cookies et vos données personnelles pour ces motifs supplémentaires, cliquez sur Refuser tout . Si vous souhaitez personnaliser vos choix, cliquez sur Gérer les paramètres de confidentialité . Vous pouvez révoquer votre consentement ou modifier vos choix à tout moment en cliquant sur les liens « Paramètres de confidentialité et des cookies » ou « Tableau de bord sur la confidentialité » présents sur nos sites et dans nos applications. Découvrez comment nous utilisons vos données personnelles dans notre Politique de confidentialité et notre Politique concernant les cookies ."},
{"company": "AAPL", "title": "Why Alphabet Rules The Magnificent 7 As AI Trade Falters. Is Google Stock A Buy?", "publisher": "Investor's Business Daily", "link": "https://www.investors.com/news/technology/google-stock-buy-alphabet-stock-november-2025/?src=A00220&yptr=yahoo", "summary": "The artificial intelligence trade is in trouble but Google stock hit an all-time high of 306.42 on Nov. 20 amid market volatility.", "time": "2025-11-24 12:45:08", "full_text": "BREAKING: Futures Rise; Google, Novo Nordisk Early Movers The artificial intelligence trade is in trouble but Google-parent Alphabet has been on a roll. In the words of economist Ed Yardeni, \"while the AI bubble isn't bursting, it is losing some air.\" But Google stock hit an all-time high of 306.42 on Nov. 20 amid market volatility. Many investors have focused on whether the tech giant will be in… 11/24/2025 Futures rose Monday. Google popped amid Salesforce CEO Marc Benioff's praise for AI model Gemini 3. Novo Nordisk dived on... 11/24/2025 Futures rose Monday. Google popped amid Salesforce CEO Marc Benioff's... The antibody drug conjugates market could be worth north of $32 billion by 2033, according to Grand View Research. (© Dave Cutler) Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Information in Investor’s Business Daily is for informational and educational purposes only and should not be construed as an offer, recommendation, solicitation, or rating to buy or sell securities. The information has been obtained from sources we believe to be reliable, but we make no guarantee as to its accuracy, timeliness, or suitability, including with respect to information that appears in closed captioning. Historical investment performances are no indication or guarantee of future success or performance. Authors/presenters may own the stocks they discuss. We make no representations or warranties regarding the advisability of investing in any particular securities or utilizing any specific investment strategies. Information is subject to change without notice. For information on use of our services, please see our Terms of Use . *Real-time prices by Nasdaq Last Sale. Real-time quote and/or trade prices are not sourced from all markets. Ownership data provided by LSEG and Estimate data provided by FactSet. IBD, IBD Digital, IBD Live, IBD Weekly, Investor's Business Daily, Leaderboard, MarketDiem, MarketSurge and other marks are trademarks owned by Investor's Business Daily, LLC. ©2025 Investor’s Business Daily, LLC. All Rights Reserved."}
]