[
{"company": "TSLA", "title": "Tesla stock price target bumped on robotaxi, autonomous driving", "publisher": "Yahoo Finance Video", "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=3_cc-session_182f6bbf-947c-4a89-8937-19cbb5b4ae34", "summary": "Tesla (TSLA) stock is trading higher after Stifel analysts lifted their price target on the EV maker to $508 per share on the company's robotaxi and full self-driving (FSD) tech. Yahoo Finance Senior Autos Reporter Pras Subramanian examines the analyst note and sentiment about Tesla on Wall Street. To watch more expert insights and analysis on the latest market action, check out more&nbsp;Market Domination Overtime.", "time": "2025-11-17 21:35:19", "full_text": "Yahoo fait partie de la famille de marques Famille de marques Yahoo Les sites et applications que nous possédons et exploitons, notamment Yahoo, AOL, Engadget, In The Know et Makers. Yahoo . Si vous ne souhaitez pas que nos partenaires et nous–mêmes utilisions des cookies et vos données personnelles pour ces motifs supplémentaires, cliquez sur Refuser tout . Si vous souhaitez personnaliser vos choix, cliquez sur Gérer les paramètres de confidentialité . Vous pouvez révoquer votre consentement ou modifier vos choix à tout moment en cliquant sur les liens « Paramètres de confidentialité et des cookies » ou « Tableau de bord sur la confidentialité » présents sur nos sites et dans nos applications. Découvrez comment nous utilisons vos données personnelles dans notre Politique de confidentialité et notre Politique concernant les cookies ."},
{"company": "AAPL", "title": "Google earns the Berkshire Hathaway vote of confidence", "publisher": "Yahoo Finance", "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=3_cc-session_7aae5763-959a-49a7-a891-b23e25c3b14e", "summary": "Investors see a path for Google in an uncertain moment for AI.", "time": "2025-11-18 11:00:42", "full_text": "Yahoo fait partie de la famille de marques Famille de marques Yahoo Les sites et applications que nous possédons et exploitons, notamment Yahoo, AOL, Engadget, In The Know et Makers. Yahoo . Si vous ne souhaitez pas que nos partenaires et nous–mêmes utilisions des cookies et vos données personnelles pour ces motifs supplémentaires, cliquez sur Refuser tout . Si vous souhaitez personnaliser vos choix, cliquez sur Gérer les paramètres de confidentialité . Vous pouvez révoquer votre consentement ou modifier vos choix à tout moment en cliquant sur les liens « Paramètres de confidentialité et des cookies » ou « Tableau de bord sur la confidentialité » présents sur nos sites et dans nos applications. Découvrez comment nous utilisons vos données personnelles dans notre Politique de confidentialité et notre Politique concernant les cookies ."},
{"company": "AAPL", "title": "Apple takes 25% share of China smartphone market in October on iPhone 17 demand", "publisher": "Reuters", "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=3_cc-session_15b4c444-2e9f-47c7-9ccf-f8f4ef7d3252", "summary": "Apple last ‌achieved this market share milestone in 2022 when competition in the premium segment was weaker.  China’s overall smartphone sell-through grew 8% year-over-year in October, driven by Apple and domestic manufacturers, data showed.  ⁠All three iPhone 17 ‌variants posted mid-to-high double-digit percentage growth, led by the base variant, Counterpoint said.", "time": "2025-11-18 08:20:25", "full_text": "Yahoo fait partie de la famille de marques Famille de marques Yahoo Les sites et applications que nous possédons et exploitons, notamment Yahoo, AOL, Engadget, In The Know et Makers. Yahoo . Si vous ne souhaitez pas que nos partenaires et nous–mêmes utilisions des cookies et vos données personnelles pour ces motifs supplémentaires, cliquez sur Refuser tout . Si vous souhaitez personnaliser vos choix, cliquez sur Gérer les paramètres de confidentialité . Vous pouvez révoquer votre consentement ou modifier vos choix à tout moment en cliquant sur les liens « Paramètres de confidentialité et des cookies » ou « Tableau de bord sur la confidentialité » présents sur nos sites et dans nos applications. Découvrez comment nous utilisons vos données personnelles dans notre Politique de confidentialité et notre Politique concernant les cookies ."},
{"company": "AAPL", "title": "China smartphone market sees 8% growth in October, iPhone 17 leads surge", "publisher": "Investing.com", "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=3_cc-session_cd08f6c5-9631-4d55-b98c-c64204b8940e", "summary": "Investing.com -- China’s smartphone market grew 8% year-over-year in October, with Apple Inc (NASDAQ:AAPL) capturing 25% of all sales as the iPhone 17 series continues its strong performance.", "time": "2025-11-18 08:56:30", "full_text": "Yahoo fait partie de la famille de marques Famille de marques Yahoo Les sites et applications que nous possédons et exploitons, notamment Yahoo, AOL, Engadget, In The Know et Makers. Yahoo . Si vous ne souhaitez pas que nos partenaires et nous–mêmes utilisions des cookies et vos données personnelles pour ces motifs supplémentaires, cliquez sur Refuser tout . Si vous souhaitez personnaliser vos choix, cliquez sur Gérer les paramètres de confidentialité . Vous pouvez révoquer votre consentement ou modifier vos choix à tout moment en cliquant sur les liens « Paramètres de confidentialité et des cookies » ou « Tableau de bord sur la confidentialité » présents sur nos sites et dans nos applications. Découvrez comment nous utilisons vos données personnelles dans notre Politique de confidentialité et notre Politique concernant les cookies ."},
{"company": "AAPL", "title": "Billionaire Warren Buffett Just Made a Massive $4 Billion Investment in This Artificial Intelligence (AI) Stock", "publisher": "Motley Fool", "link": "https://www.fool.com/investing/2025/11/18/billionaire-warren-buffett-invest-ai-stock-goog/", "summary": "Berkshire Hathaway is spreading its wings into new Magnificent Seven stocks.", "time": "2025-11-18 09:25:00", "full_text": "Berkshire Hathaway is spreading its wings into new Magnificent Seven stocks. Warren Buffett and Berkshire Hathaway ( BRK.B 1.11% ) ( BRK.A 1.11% ) continue to sell Apple stock, increasing the company's cash position to close to $400 billion. One stock Berkshire is buying is Alphabet ( GOOG +3.10% ) ( GOOGL +3.13% ) . The technology giant and leading artificial intelligence ( AI ) stock has been a favorite of Buffett and the team for years, although they have never bought the stock. That is, until last quarter, when Berkshire Hathaway bought over $4 billion worth of the company that owns Google Search, YouTube, Waymo, and the Gemini AI chatbot. Does that mean you should follow Berkshire Hathaway and buy Alphabet stock for your own portfolio today? Image source: Getty Images. After the launch of OpenAI's ChatGPT, Google and Alphabet were deemed AI losers by Wall Street. Even though Alphabet was on the cutting edge of AI research, it was losing ground (and quickly) to ChatGPT and its viral growth. Investors were concerned that the company's cash cow, Google Search revenue, would decline, potentially leading to a weakening company. Today, it is clear that these concerns were misguided. Alphabet has fought back aggressively against the AI start-ups with its own Gemini chatbot, which has rapidly grown to 650 million monthly active users (MAUs), while the company implements new AI overviews for Google Search results to improve the user value proposition. These AI developments enabled Google Search revenue to grow close to 15% year over year last quarter to $56 billion, likely with extremely high profit margins (Alphabet doesn't break out specific Google Search margins). What has become a risk to the business is now an advantage. Alphabet keeps taking market share of AI chatbots, and has wholly owned infrastructure in computer chips and data centers that enable it to rapidly scale up usage without breaking the bank. This is something the start-up competitors do not have. In fact, competitor OpenAI recently went to Google Cloud to buy compute power for ChatGPT, a clear example of Alphabet's infrastructure advantage in this space. What's great about Alphabet is that it is much more than just Google Search. There is the YouTube business, which is doing over $10 billion in advertising revenue every quarter, along with steadily growing subscription revenue. Total Google subscriptions -- which include YouTube, Google Drive, and Gemini subscriptions -- hit $12.8 billion last quarter and are growing 21% year over year. There is also the self-driving taxi network Waymo. It is not relevant from a revenue perspective today, but it is scaling rapidly across the country and entering new cities on a regular basis. Rides are growing exponentially and could become a driving force for Alphabet's business over the long term. The gem of growth today is Google Cloud, doing $15 billion in revenue last quarter and growing 34% year over year. This is the division that OpenAI is buying computing power from, among many other AI start-ups. With demand expected to soar for AI in the coming years, Google Cloud has a good opportunity to keep growing its revenue at such an aggressive rate through the rest of the decade. Data by YCharts . Berkshire Hathaway took a stake in Alphabet back in the third quarter, when the price of the stock may have been closer to $200 a share. Today, Alphabet trades at close to $290. Does that mean the stock is now expensive? I don't think so. Alphabet has a trailing price-to-earnings ratio ( P/E ) of 28, which is below the S&P 500 index average right now. Its revenue keeps growing quickly, and it has the potential for massive operating leverage once its new AI initiatives start catching up in revenue generation. Even though Buffett and the team bought this stock at a lower price, Alphabet looks like a solid bet for any investor hunting for a Magnificent Seven stock to buy today. Brett Schafer has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet, Apple, and Berkshire Hathaway. The Motley Fool has a disclosure policy . *Average returns of all recommendations since inception. Cost basis and return based on previous market day close. Related Articles Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2025 The Motley Fool . All rights reserved. Market data powered by Xignite and Polygon.io . About The Motley Fool Our Services Around the Globe Free Tools Affiliates & Friends"},
{"company": "AAPL", "title": "FTSE 100 LIVE: London near one-month low as Google boss warns no company immune if AI bubble bursts", "publisher": "Yahoo Finance UK", "link": "https://uk.finance.yahoo.com/news/ftse-100-live-stocks-google-ai-bubble-markets-091728019.html", "summary": "'I think no company is going to be immune, including us,' Alphabet CEO Sundar Pichai said.", "time": "2025-11-18 09:17:28", "full_text": "Une erreur s’est produite The FTSE 100 ( ^FTSE ) and European stocks tumbled on Tuesday as the boss of Google ( GOOG ) warned that every company in the world could take a hit if a bubble in AI stocks burst. Speaking to BBC News, Sundar Pichai said while the growth of AI investment had been an \"extraordinary moment\", there was some \"irrationality\" in the current boom. “I think no company is going to be immune, including us,\" he said. \"We can look back at the internet right now. There was clearly a lot of excess investment, but none of us would question whether the internet was profound. \"I expect AI to be the same. So I think it's both rational and there are elements of irrationality through a moment like this.\" Tech stocks suffered a sharp sell-off overnight as traders become uneasy about soaring valuations. Read more: Trending tickers: Nvidia, Coinbase, Imperial Brands, Crest Nicholson and Greencore His comments come a day after Google parent firm Alphabet saw its shares surge by more than 3% after Warren Buffett’s Berkshire Hathaway ( BRK-B ) disclosed it had taken a stake in the tech giant. Kathleen Brooks, research director at XTB, said: \"There are multiple drivers of markets right now, including fears about AI tech stock valuations, concerns about a weakening US economic outlook, and concerns that the Fed won’t cut interest rates fast enough. \"Even traditional safe havens are faltering this morning; gold is lower by $23 per ounce and is just about clinging on to the $4,000 level. Luxury stocks, which used to be considered ‘recession proof’, are leading European indices lower. Hermes ( RMS.PA ) and LVMH ( MC.PA ) are some of the worst performers on the Eurostoxx so far on Tuesday and are falling alongside tech stocks such as Dutch giant ASML ( ASML ). \"In FX, the yen and the Swiss Franc are performing like their safe haven status would suggest, and they are leading the G10 FX pack so far.\" Meanwhile, investors remain concerned about data on the US jobs market due for release on Thursday and continue to reduce their bets on a December rate cut by the Federal Reserve. Futures now imply just a 41% probability, down from 43% on Friday. Stocks: Create your watchlist and portfolio London’s benchmark index ( ^FTSE ) was 1.4% lower in afternoon trade, moving further away from the record high of 9,930 points set last week and near a one-month low. Mining stocks were among the big fallers. Germany's DAX ( ^GDAXI ) dipped 1.5% and the CAC ( ^FCHI ) in Paris also headed 1.5% into the red. The pan-European STOXX 600 ( ^STOXX ) was down 1.5%. Wall Street is set for a negative start as S&P 500 futures ( ES=F ), Dow futures ( YM=F ) and Nasdaq futures ( NQ=F ) were all in the red. The pound was 0.1% down against the safe-haven US dollar ( GBPUSD=X ) at 1.3142. Follow along for live updates throughout the day: Websites including X and Spotify have been hit by a major outage linked to Cloudflare. Thousands of users reported issues with a host of different websites, including the film review site Letterboxd, which were impacted by technical issues at the internet network services business. Users of other apps including artificial intelligence chatbot ChatGPT also reported problems. The DownDetector monitoring site, which was itself hit by the outage, showed a flurry of reported issues after 11am on Tuesday. More than 10,000 DownDetector users reported issues related to Cloudflare. A number of the websites affected, including X, came back online temporarily before suffering further problems. Users saw a message on a number of the websites saying the issues were caused by an “internal server error on Cloudflare’s network”. Cloudflare provides network and security services for many online businesses in order to help their websites and applications operate. The company said in a server update that it was “experiencing an internal service degradation” and that some service may be intermittently affected. It added: “We are seeing services recover, but customers may continue to observe higher-than-normal error rates as we continue remediation efforts.” Cloudflare, which runs services such as checking that visitors to websites are humans rather than bots, says around a fifth of all global websites use some of its services. Apple's ( AAPL ) iPhone 17 drove a 37% rise in its monthly smartphone sales in China. The latest iPhone models accounted for one in every four smartphones sold in the country in October, the first time it has hit that threshold since 2022, according to Counterpoint Research. The 8% growth figure suggests Apple’s year-on-year upgrades are resonating with consumers and support boss Tim Cook’s prediction that the company will return to growth in China this quarter. Each of the successor models, from the 5,999-yuan (about $850) iPhone 17 to the 8,999-yuan 17 Pro Max, outperformed its iPhone 16 precursor in sales by a double-digit percentage, Counterpoint said. Meanwhile, Oppo’s smartphone sales grew 19% during the month from a year earlier, driven by demand for its Find X9 device with a larger battery. Huawei Technologies slipped by 19%, partly as it did not release a new model in October. Huawei remains Apple’s biggest rival in China, with a new flagship device launch planned for next week, though demand for the iPhone 17 appears steady. Shares in Crest Nicholson ( CRST.L ) slid more than 8% on Tuesday morning, after it warned it expects to report lower pre-tax profit for the year. In a full-year trading update, the housebuilder said it expected adjusted profit before tax to be at the low end of, or marginally below, a previous guidance range of £28m to £38m. Martyn Clark, CEO of Crest Nicholson, said that this reflected a \"housing market that has remained subdued through the summer, and the continued uncertainty surrounding government tax policy ahead of the forthcoming budget.\" It also expects to complete 1,691 homes this year, at the lower end of its range of between 1,700 and 1,900 homes, including 35% affordable units. Its sales rate was 0.51, compared with 0.48 in 2024, although it dropped to 0.45 in the last 13 weeks of its financial year. It has sold five land parcels from larger sites as it trims its landbank, and is working on a new house type range. The company is closing one divisional office and will cut 50 jobs, including staff at the site and some “selective other roles” across overhead functions. Adam Vettese, a market analyst for eToro, said that Crest Nicholson's latest trading update \"highlights the ongoing difficulties facing UK housebuilders\". \"The combination of weaker volumes, margin pressures, and a lack of near-term catalysts leaves the investment case cautious for now,\" he said. \"Investors and would-be homebuyers alike will be looking to Westminster for reassurance that support for the UK housing market is not about to diminish further.\" Read more: Stocks that are trending today More than half of British businesses are putting investment plans on hold until after next week’s budget while uncertainty over taxes and policy is hitting small firms the hardest, according to a report. The latest Barclays Business Prosperity index survey found 55% of all firms polled are pausing investment decisions until after the chancellor’s long-awaited budget, with speculation swirling over whether taxes will or will not be increased. Small firms are instead boosting their savings and building up a “precautionary” buffer, with savings growing at a greater rate than for large corporates, up 6.1% year-on-year, Barclays said. The lending giant said small and medium sized companies (SMEs) also remained “tentative to borrow to invest” despite signs of a wider recovery in lending activity, with loan balances up 2.2% year-on-year in the third quarter, driven largely by larger corporates. The report also showed the impact of budget worries, with more than four in 10 (45%) leaders of small businesses with fewer than 50 employees saying the level of certainty over future policy was having a negative impact on their companies. Nearly a third of the 1,000 firms polled for the report called for greater policy stability from the chancellor to unlock private sector investment. In a sign of brighter times on the horizon, 83% of companies said they planned to ramp up investment if the chancellor introduces supportive measures, such as reducing operating costs, improving access to skilled labour and providing policy stability. Read the full article here Shares in Imperial Brands ( IMB.L ) were up more than 2% on Tuesday morning, on the back of the tobacco giant's full-year results. Revenue for the year came in at £32.2bn ($42.4bn), which was slightly lower than the £32.4bn reported last year. Adjusted operating profit of £3.99bn was 4.6% higher than last year on a constant currency basis, while adjusted earnings per share (EPS) of 315p were up 9.1% compared to 2024. The traditional cigarette business remains resilient, with stable market share overall and gains in Germany and Australia offsetting modest declines in Spain and the UK. Revenue growth of 4% was driven by strong pricing (5%), offsetting volume declines of 2%, though these are reported to have eased slightly since. Next generation products (NGP) continued to build momentum, with net revenue up 14% and operating losses marginally down. Imperial is making share gains across vapor, heated tobacco, and nicotine pouches, supporting its longer-term strategy. Derren Nathan, head of equity research at Hargreaves Lansdown, said: In terms of its outlook for the 2026 fiscal year, Imperial said it expected to deliver net revenue growth in the low-single-digits for its tobacco business and in the double-digits for next-generation products. The company expects operating profit to grow in the 3% to 5% range. \"While there’s still some work to do to prove Imperial’s challenger status in next generation products, it’s establishing a reliable track record for generous payouts to shareholders, having distributed £10bn over the last five years, and looks well placed to maintain its distribution yield (dividends and buybacks) at over 10%,\" said Nathan. UK household energy bills are expected to fall slightly in the new year, according to new data from consultancy Cornwall Insight. The forecaster expects homes using a typical amount of gas and electricity will pay £1,733 from January, a decrease of £22 per year, or 1%, from the current £1,755 price cap for a typical household's annual energy bill. However, Dr Craig Lowrey, principal consultant at Cornwall Insight, warned the decrease is \"only part of the picture\", with bills set to climb again in April. Regulator Ofgem will announce the latest price cap for around 22 million households in England, Wales and Scotland at the end of November. Gold ( GC=F ) prices extended their decline on Tuesday morning, marking a fourth consecutive session of losses as a firmer US dollar and waning expectations of a Federal Reserve rate cut next month pressured the precious metal. Gold futures fell 1.2% to $4,026.30 per ounce, while spot gold lost 1.5% to $4,024.38 an ounce at the time of writing. Matt Britzman, an analyst at Hargreaves Lansdown, said: “Gold extended its slide, underscoring a growing correlation with risk assets as it fell in tandem with equities and even speculative plays like Bitcoin, now below $90,000 for the first time in six months, as markets reassess rate cut hopes. “Traditionally a safe haven, gold’s new found inability to decouple from other asset classes could tarnish its defensive role heading into year-end.” The moves came as the dollar strengthened, weighing on commodities priced in the US currency. \"The dollar was a bit stronger today and also some of the speculative length has been reduced this past week. The gold market is going to consolidate for now,\" said Marex analyst Edward Meir. Market attention this week is fixed on a series of US economic releases, including Thursday’s September nonfarm payrolls report, for signals on the strength of the world’s largest economy and the Fed’s next steps. \"Expectations the Fed will cut again next month dropped to 42% overnight from a high of almost 100% soon after the September decision. This has weighed on investor appetite for gold,\" ANZ said in a note. \"Nonetheless, structural tailwinds, such as geopolitical uncertainty, concerns about US debt sustainability, de-dollarisation trends and central bank buying, are expected to support investment demand in the medium- and long-term.\" Read more: Should you invest in gold? Reselling tickets to live events for profit is to be outlawed by the government under plans due to be announced this week. Ministers are set to announce the plan in a bid to tackle touts and resale sites, such as Viagogo and StubHub, which often offer music, theatre, comedy and sport tickets at well above face value. The decision, due to be announced on Wednesday, comes a week after dozens of world-renowned artists – including Radiohead, Dua Lipa and Coldplay – issued an open plea to prime ministerKeir Starmer to follow through on Labour’s general election manifesto pledge by stopping “pernicious” touts. Under the plan, which could form part of next year’s King’s speech, anyone selling a ticket will not be allowed to charge more than they paid for it. Resale platforms will be allowed to charge fees on top of that price. These extras will also be limited, to ensure that they cannot be inflated artificially to offset profits forfeited owing to the legislation. The scale of the ceiling on service fees is yet to be determined. The ban will also govern social media sites, which resale platforms have claimed would offer unregulated and potentially fraudulent tickets if legislation squeezes online ticket exchanges out of the market. Anyone reselling a ticket will also be prohibited from offering more tickets than they could have procured under limits set by the original box office company. The Department for Culture, Media and Sport (DCMS) suggested the move would end the \"business model of industrial-scale ticket touting\", and would make resale tickets £37 cheaper on average, saving fans collectively £112m per year. \"Ticket touting has become increasingly sophisticated in recent years,\" a DCMS statement said. \"Touts buy large volumes of tickets online, often using automated bots, before relisting them on resale platforms at hugely inflated prices. This has caused misery for millions of fans and damaged the live events industry. \"The new laws will stamp out this practice, improving access for genuine fans when tickets originally go on sale and ending rip-off pricing on the resale market.\" Housing Secretary Steve Reed told BBC Breakfast touts making profits at the expense of fans was \"such an important issue\" as it was \"hugely damaging to individuals having to pay through the nose for tickets\". He stressed the government was \"committed to outlawing it\". Here are the top FTSE risers and fallers this morning: The price of bitcoin ( BTC-USD ) fell to its lowest level since April as global markets racked up their fourth day of losses in a row amid concerns over technology valuations. The world’s largest crypto coin dropped as low as $89,286 on Tuesday morning, reaching a seven-month low, meaning it has lost all its gains made in 2025. Bitcoin has now fallen by almost a third since hitting a record high at the start of last month. According to data from CoinGecko, the global cryptocurrency market cap is $3.15trn, down from $4,379trn on 7 October. Victoria Scholar, head of investment at Interactive Onvestor, said: The boss of Google ( GOOG ) warned that every company in the world could take a hit if a bubble in AI stocks burst. Speaking to BBC News, Sundar Pichai said while the growth of AI investment had been an \"extraordinary moment\", there was some \"irrationality\" in the current boom. Tech stocks suffered a sharp sell-off overnight as traders become uneasy about soaring valuations. Tareck Horchani of Singapore investment bank Maybank Securities said: “It’s starting to feel like investor conviction at current levels is fading. “It’s less about a sharp catalyst and more about positioning fatigue, valuation sensitivity, and a growing sense that the rally needs a pause.” His comments come a day after Google parent firm Alphabet saw its shares surge by more than 3% after Warren Buffett’s Berkshire Hathaway disclosed it had taken a stake in the tech giant. The UK's deposit protection limit for customers of banks, building societies, and credit unions will increase to £120,000, up from £85,000, from 1 December 2025. The move aims to strengthen consumer confidence and provide greater security for depositors in the event that their financial institution fails. The new limit applies to deposits held with UK-authorised financial institutions, and it is designed to protect customers in the event of a bank, building society, or credit union failing. The increase marks the first change in the deposit protection limit since 2017, when it was set at £85,000. The Financial Services Compensation Scheme (FSCS) will implement the higher limit automatically, meaning customers do not need to take any action to benefit from the increased protection. The FSCS guarantees that customers will receive their compensation, up to the £120,000 limit, within seven days of a financial institution’s failure. Justifying the increase, Sam Woods, deputy governor for Prudential Regulation at the Bank of England and chief executive of the Prudential Regulation Authority (PRA), said: The new £120,000 limit also exceeds an earlier PRA proposal of £110,000, which was adjusted following consultations with the banking sector. The move aims to provide consumers with more protection as inflation continues to erode the real value of their savings. Customers holding accounts with more than one brand under the same banking licence should take note that the £120,000 protection applies to the total balance across all their accounts within that group. Therefore, if a banking group operates several brands, the compensation limit applies to the aggregate balance of the accounts, not individually. Read more here Stocks in Asia slumped overnight after Nvidia ( NVDA ) and other companies linked to artificial intelligence pulled US stocks lower. The Nikkei ( ^N225 ) tumbled 3.2% on the day in Japan, with selling of tech shares leading the decline, while the Hang Seng ( ^HSI ) fell 1.7% in Hong Kong. Regional markets felt a chill after the yield on 30-year Japanese government bonds surged to 3.31%, reflecting rising risks as prime minister Sanae Takaichi prepares to boost government spending and push back the timetable for bringing down Japan’s huge national debt. The Shanghai Composite ( 000001.SS ) was 0.8% down by the end of the session and in South Korea, which relies heavily on trade in computer chips, the Kospi ( ^KS11 ) lost 3.3% on the day. Across the pond, the S&P 500 ( ^GSPC ) fell 0.9% to 6,672.41, pulling further from its all-time high set late last month, and marking its worst three-day run since April. The tech-heavy Nasdaq ( ^IXIC ) was 0.8% lower, closing at 22,708.07, and thThe Dow Jones ( ^DJI ) lost 1.2% to close at 46,590.24 It comes as computer chip giant Nvidia is due to report its earnings on Wednesday amid worries that stock prices of AI companies have shot too high. The stock dropped 1.8% on the day, although it is still up nearly 40% this year Also hanging over the markets is the release of US employment data due on Thursday, which was delayed by the prolonged government shutdown. Good morning, and welcome back to our markets live blog. As usual we will be taking a deep dive into what's moving markets and what's happening across the global economy. Here's a quick look at what's on the agenda for today: 7am: Trading updates: Imperial Brands, Diploma, FirstGroup, Greencore, Softcat, Great Portland Estates, Crest Nicholson, CVS Group, ICG, Trifast, Gear4Music, CML Microsystems 10am : Treasury Committee hearing on risks and rewards of embracing crypto 1pm : Huw Pill, Bank of England’s chief economist, to give speech at Skinners Hall, London 3pm : US factory orders and durable goods data for August Download the Yahoo Finance app, available for Apple and Android . Connectez-vous pour accéder à votre portefeuille"},
{"company": "AAPL", "title": "Stagwell Inc. (STGW) is a Buy at Needham Amid Deals with Tech Giants", "publisher": "Insider Monkey", "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=3_cc-session_c3e9a2ec-2063-4989-8b8e-79411b5ea6d5", "summary": "Stagwell Inc. (NASDAQ:STGW) is a must-buy penny stock to buy now. On November 4, Needham analyst Laura Martin reiterated a Buy rating on Stagwell Inc. (NASDAQ:STGW) and lifted the price target from $6.36 to $7.25, impressed by the strategic partnership the company has inked with technology companies. According to the analyst, deals with OpenAI, Google, […]", "time": "2025-11-18 11:17:10", "full_text": "Yahoo fait partie de la famille de marques Famille de marques Yahoo Les sites et applications que nous possédons et exploitons, notamment Yahoo, AOL, Engadget, In The Know et Makers. Yahoo . Si vous ne souhaitez pas que nos partenaires et nous–mêmes utilisions des cookies et vos données personnelles pour ces motifs supplémentaires, cliquez sur Refuser tout . Si vous souhaitez personnaliser vos choix, cliquez sur Gérer les paramètres de confidentialité . Vous pouvez révoquer votre consentement ou modifier vos choix à tout moment en cliquant sur les liens « Paramètres de confidentialité et des cookies » ou « Tableau de bord sur la confidentialité » présents sur nos sites et dans nos applications. Découvrez comment nous utilisons vos données personnelles dans notre Politique de confidentialité et notre Politique concernant les cookies ."},
{"company": "AAPL", "title": "Apple Jumps to 25% Market Share in China", "publisher": "GuruFocus.com", "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=3_cc-session_ce628127-a9fd-42e0-a781-321fac429152", "summary": "iPhone 17 lineup sparks a major rebound for Apple", "time": "2025-11-18 11:28:38", "full_text": "Yahoo fait partie de la famille de marques Famille de marques Yahoo Les sites et applications que nous possédons et exploitons, notamment Yahoo, AOL, Engadget, In The Know et Makers. Yahoo . Si vous ne souhaitez pas que nos partenaires et nous–mêmes utilisions des cookies et vos données personnelles pour ces motifs supplémentaires, cliquez sur Refuser tout . Si vous souhaitez personnaliser vos choix, cliquez sur Gérer les paramètres de confidentialité . Vous pouvez révoquer votre consentement ou modifier vos choix à tout moment en cliquant sur les liens « Paramètres de confidentialité et des cookies » ou « Tableau de bord sur la confidentialité » présents sur nos sites et dans nos applications. Découvrez comment nous utilisons vos données personnelles dans notre Politique de confidentialité et notre Politique concernant les cookies ."},
{"company": "AAPL", "title": "Better Semiconductor Stock: TSMC vs. ASML", "publisher": "Motley Fool", "link": "https://www.fool.com/investing/2025/11/18/better-semiconductor-stock-tsmc-vs-asml/", "summary": "Which of these bellwethers of the semiconductor market is a better buy?", "time": "2025-11-18 12:02:00", "full_text": "Which of these bellwethers of the semiconductor market is a better buy? TSMC ( TSM 0.95% ) and ASML ( ASML +1.15% ) are both linchpins of the semiconductor market. Taiwan Semiconductor Manufacturing (TSMC) is the world's largest and most advanced contract chipmaker. ASML is the largest producer of lithography systems, which are used by TSMC and other foundries to optically etch circuit patterns onto silicon wafers. ASML is also the only producer of extreme ultraviolet (EUV) lithography systems which are used to manufacture the world's smallest and densest chips. By adopting ASML's EUV systems at a faster rate than Intel ( INTC 2.44% ) and Samsung, TSMC pulled ahead in the \"process race\" to produce smaller chips. Today, most of the world's top fabless chipmakers -- including Nvidia ( NVDA 1.91% ) , AMD , Apple , and Qualcomm -- outsource their production to TSMC. Over the past five years, TSMC's stock nearly tripled as ASML's stock more than doubled. Let's see why both stocks soared, and which one is the better overall investment right now. Image source: Getty Images. From 2020 to 2024, TSMC's annual revenue grew at a CAGR of 24% as its earnings per share (EPS) increased at a CAGR of 19%. That robust growth was driven by the market's strong demand for its 5nm chips, the mass production of its smaller 3nm chips, and the secular expansion of the high-performance computing (HPC) market, which included Nvidia's powerful data center GPUs for processing artificial intelligence (AI) applications . TSMC's advanced packaging technologies also boosted its gross margins per chip, and it used AI to streamline its own process control and material handling technologies. It also built more overseas fabs to reduce its exposure to a potential military conflict between Taiwan and China. In the third quarter of 2025, TSMC generated 60% of its revenue from its smallest 3nm and 5nm nodes. In terms of platforms, it generated 57% of its revenue from the HPC market, 30% from smartphone makers, and the rest from other industries. During that earnings report, TSMC lifted its full-year revenue guidance from around 30% growth to mid-30% growth. CEO C.C. Wei attributed that rosier outlook to the AI megatrend generating strong tailwinds for Nvidia and other AI chipmakers. From 2024 to 2027, analysts expect TSMC's revenue to EPS to grow at a CAGR of 24% and 27%, respectively. Those are impressive growth rates for a stock that still trades at 19 times forward earnings . Its upcoming catalysts include the expansion of the AI market, the stabilization of the PC and smartphone markets, and the memory market's new growth cycle. Its newest 2nm node and its adoption of ASML's newest \"high-NA\" EUV systems -- which can produce even smaller chips -- should keep it far ahead of its rivals. From 2020 to 2024, ASML's revenue and EPS grew at a CAGR of 19% and 23%, respectively. It benefited from the same tailwinds as TSMC, but it also continued to sell its older deep ultraviolet (DUV) systems to producers of larger legacy chips. ASML's EUV systems cost more than $200 million and require multiple planes to ship, while its smaller DUV systems still cost up to $90 million. Those price tags are steep, but ASML's dominance of that market gives it nearly unlimited pricing power. ASML also locks in its top customers like TSMC with recurring maintenance and service fees. From 2024 to 2027, analysts expect ASML's revenue and EPS to increase at a CAGR of 11% and 18%, respectively. The expansion of the AI market, stabilizing sales of PCs and smartphones, and the memory market's upswing should boost its EUV shipments. Howevver, its growth could be throttled by the tightening export curbs against Chinese chipmakers. ASML was already barred from exporting its EUV systems to China in 2019, but that ban could be expanded to cover its higher-end DUV systems. Therefore, its sales to mainland China (36% of its revenue in 2024) could dry up over the next few years. Meanwhile, several of its top customers -- including TSMC -- are pushing their existing \"low-NA\" EUV systems to their limits before placing big orders for more high-NA EUV systems (which cost more than $400 million). Those delays could throttle its sales growth and disrupt its margin-boosting transition from low-NA to high-NA EUV systems. Its stock isn't cheap at 34 times next year's earnings, and it could face more near-term headwinds than TSMC. TSMC and ASML are both solid long-term investments on the secular expansion of the semiconductor market. But if I had to pick one over the other right now, I'd stick with TSMC because it's more broadly diversified, it faces fewer regulatory headwinds, it's growing faster, and it trades at a lower valuation. Leo Sun has positions in ASML and Apple. The Motley Fool has positions in and recommends ASML, Advanced Micro Devices, Apple, Intel, Nvidia, Qualcomm, and Taiwan Semiconductor Manufacturing. The Motley Fool recommends the following options: short November 2025 $21 puts on Intel. The Motley Fool has a disclosure policy . *Average returns of all recommendations since inception. Cost basis and return based on previous market day close. Related Articles Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2025 The Motley Fool . All rights reserved. Market data powered by Xignite and Polygon.io . About The Motley Fool Our Services Around the Globe Free Tools Affiliates & Friends"},
{"company": "AAPL", "title": "Apple Reclaims China Market -- iPhone 17 Drives Share to 25%", "publisher": "GuruFocus.com", "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=3_cc-session_df8d5897-f626-476b-a199-4ecfd3906cf1", "summary": "Apple Hits 25% Share in China as New Models Outperform", "time": "2025-11-18 12:34:26", "full_text": "Yahoo fait partie de la famille de marques Famille de marques Yahoo Les sites et applications que nous possédons et exploitons, notamment Yahoo, AOL, Engadget, In The Know et Makers. Yahoo . Si vous ne souhaitez pas que nos partenaires et nous–mêmes utilisions des cookies et vos données personnelles pour ces motifs supplémentaires, cliquez sur Refuser tout . Si vous souhaitez personnaliser vos choix, cliquez sur Gérer les paramètres de confidentialité . Vous pouvez révoquer votre consentement ou modifier vos choix à tout moment en cliquant sur les liens « Paramètres de confidentialité et des cookies » ou « Tableau de bord sur la confidentialité » présents sur nos sites et dans nos applications. Découvrez comment nous utilisons vos données personnelles dans notre Politique de confidentialité et notre Politique concernant les cookies ."},
{"company": "TSLA", "title": "'You Don't Drive A $27,000 Car With A $60,000 Income,' Says Dave Ramsey, Urging 27-Year-Old Dad With $100,000 Debt To Sell The Car", "publisher": "Benzinga", "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=3_cc-session_8bd3cd97-d7e9-4911-adcb-cae4403bf8ec", "summary": "A 27-year-old Texas man called into \"The Ramsey Show\" to ask how he and his wife, who earns $60,000 a year, could handle about $100,000 in debt — including a $27,000 car loan — while he stays home with two young children. Personal finance host Dave Ramsey immediately zeroed in: \"You don't drive a $27,000 car with a $60,000 income.\" He told the caller, whose name was Jesse, that this was a clear sign the couple needed to sell the car and reset their financial priorities. Don't Miss: Missed Nvidia", "time": "2025-11-18 01:00:23", "full_text": "Yahoo fait partie de la famille de marques Famille de marques Yahoo Les sites et applications que nous possédons et exploitons, notamment Yahoo, AOL, Engadget, In The Know et Makers. Yahoo . Si vous ne souhaitez pas que nos partenaires et nous–mêmes utilisions des cookies et vos données personnelles pour ces motifs supplémentaires, cliquez sur Refuser tout . Si vous souhaitez personnaliser vos choix, cliquez sur Gérer les paramètres de confidentialité . Vous pouvez révoquer votre consentement ou modifier vos choix à tout moment en cliquant sur les liens « Paramètres de confidentialité et des cookies » ou « Tableau de bord sur la confidentialité » présents sur nos sites et dans nos applications. Découvrez comment nous utilisons vos données personnelles dans notre Politique de confidentialité et notre Politique concernant les cookies ."},
{"company": "TSLA", "title": "Elon Musk Said He Works 'Every Waking Hour.' If You Work 100 Hours A Week While Others Work 50, You'll Get Twice As Much Done", "publisher": "Benzinga", "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=3_cc-session_37b39499-e12f-4c85-beee-e3f6ee2ad1c7", "summary": "Tesla (NASDAQ:TSLA) CEO Elon Musk has always been known for his extreme work ethic. Over the years, he’s repeatedly said that long hours and intense dedication are central to his success. His approach is simple: The more time you put in, the more you get out. Working Nonstop, Sleeping On The Floor “You need to work super hard,” Musk told graduates during a 2014 commencement speech at the University of Southern California’s Marshall School of Business. Don't Miss: Fast Company Calls It a ‘Groundb", "time": "2025-11-18 02:01:13", "full_text": "Yahoo fait partie de la famille de marques Famille de marques Yahoo Les sites et applications que nous possédons et exploitons, notamment Yahoo, AOL, Engadget, In The Know et Makers. Yahoo . Si vous ne souhaitez pas que nos partenaires et nous–mêmes utilisions des cookies et vos données personnelles pour ces motifs supplémentaires, cliquez sur Refuser tout . Si vous souhaitez personnaliser vos choix, cliquez sur Gérer les paramètres de confidentialité . Vous pouvez révoquer votre consentement ou modifier vos choix à tout moment en cliquant sur les liens « Paramètres de confidentialité et des cookies » ou « Tableau de bord sur la confidentialité » présents sur nos sites et dans nos applications. Découvrez comment nous utilisons vos données personnelles dans notre Politique de confidentialité et notre Politique concernant les cookies ."},
{"company": "TSLA", "title": "Tesla Maintained at Hold by Truist After Musk Compensation Plan Approval", "publisher": "Insider Monkey", "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=3_cc-session_4f27a1a5-7e5f-45bb-9540-2de3d4ae0dd9", "summary": "Tesla, Inc. (NASDAQ:TSLA) is one of the AI Stocks Investors Are Watching. On November 11, Truist Securities analyst William Stein reiterated a Hold rating on the stock with a $406.00 price target following the recent shareholder approval of CEO Elon Musk’s equity compensation package. According to the firm, this shareholder approval is a positive development for Tesla […]", "time": "2025-11-18 03:19:01", "full_text": "Yahoo fait partie de la famille de marques Famille de marques Yahoo Les sites et applications que nous possédons et exploitons, notamment Yahoo, AOL, Engadget, In The Know et Makers. Yahoo . Si vous ne souhaitez pas que nos partenaires et nous–mêmes utilisions des cookies et vos données personnelles pour ces motifs supplémentaires, cliquez sur Refuser tout . Si vous souhaitez personnaliser vos choix, cliquez sur Gérer les paramètres de confidentialité . Vous pouvez révoquer votre consentement ou modifier vos choix à tout moment en cliquant sur les liens « Paramètres de confidentialité et des cookies » ou « Tableau de bord sur la confidentialité » présents sur nos sites et dans nos applications. Découvrez comment nous utilisons vos données personnelles dans notre Politique de confidentialité et notre Politique concernant les cookies ."},
{"company": "TSLA", "title": "Is Tesla Still a Good Value After This Year’s 20.7% Rally?", "publisher": "Simply Wall St.", "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=3_cc-session_d9237237-82d2-485f-9a0c-c8ffe3021ac8", "summary": "Wondering if Tesla is actually worth the hype or if the current price still offers upside? Let’s break down what matters for value-focused investors. Shares have seen a rollercoaster lately, dropping 8.2% in the last week and 6.9% over the past month. However, they are still up 7.8% year-to-date and a solid 20.7% over the past 12 months. Tesla’s price movements have been influenced by high-profile updates, such as announcements around new model launches, evolving leadership strategies, and...", "time": "2025-11-18 05:07:28", "full_text": "Yahoo fait partie de la famille de marques Famille de marques Yahoo Les sites et applications que nous possédons et exploitons, notamment Yahoo, AOL, Engadget, In The Know et Makers. Yahoo . Si vous ne souhaitez pas que nos partenaires et nous–mêmes utilisions des cookies et vos données personnelles pour ces motifs supplémentaires, cliquez sur Refuser tout . Si vous souhaitez personnaliser vos choix, cliquez sur Gérer les paramètres de confidentialité . Vous pouvez révoquer votre consentement ou modifier vos choix à tout moment en cliquant sur les liens « Paramètres de confidentialité et des cookies » ou « Tableau de bord sur la confidentialité » présents sur nos sites et dans nos applications. Découvrez comment nous utilisons vos données personnelles dans notre Politique de confidentialité et notre Politique concernant les cookies ."},
{"company": "TSLA", "title": "Xiaomi’s EV Arm Makes a Profit for the First Time", "publisher": "Bloomberg", "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=3_cc-session_aa9a3cef-f6ff-40a4-aea1-588f2b15bdb6", "summary": "Xiaomi joins a select club of Chinese EV makers that actually make a profit.  The billionaire is riding high after a solid reception for Xiaomi’s first sports utility vehicle, which has garnered strong orders so far.", "time": "2025-11-18 11:53:40", "full_text": "Yahoo fait partie de la famille de marques Famille de marques Yahoo Les sites et applications que nous possédons et exploitons, notamment Yahoo, AOL, Engadget, In The Know et Makers. Yahoo . Si vous ne souhaitez pas que nos partenaires et nous–mêmes utilisions des cookies et vos données personnelles pour ces motifs supplémentaires, cliquez sur Refuser tout . Si vous souhaitez personnaliser vos choix, cliquez sur Gérer les paramètres de confidentialité . Vous pouvez révoquer votre consentement ou modifier vos choix à tout moment en cliquant sur les liens « Paramètres de confidentialité et des cookies » ou « Tableau de bord sur la confidentialité » présents sur nos sites et dans nos applications. Découvrez comment nous utilisons vos données personnelles dans notre Politique de confidentialité et notre Politique concernant les cookies ."},
{"company": "TSLA", "title": "Dow Jones Futures: Apple, Google, Nvidia, Palantir, Tesla Big Movers Amid Stock Market Drop", "publisher": "Investor's Business Daily", "link": "https://www.investors.com/market-trend/stock-market-today/dow-jones-sp500-nasdaq-apple-google-nvidia-palantir-tesla/?src=A00220&yptr=yahoo", "summary": "Dow Jones Futures: Apple, Google, Nvidia, Palantir and Tesla were big movers Monday during the stock market sell-off.", "time": "2025-11-18 03:44:00", "full_text": "TRENDING: 13 Fallen S&P 500 Stocks Slip Into Bear Market Dow Jones futures, along with S&P 500 futures and Nasdaq 100 futures, traded slightly lower ahead of Tuesday's open, after the stock market drop Monday. Meanwhile, Apple (AAPL), Alphabet (GOOGL), Nvidia (NVDA), Palantir Technologies (PLTR) and Tesla (TSLA) were big movers on the stock market Monday. Apple stock sold off 1.8% Monday, extending a losing streak to four sessions. Still,… 11/18/2025 Stock Market Today: The Dow Jones index dropped 350 points Tuesday. Home Depot, Nvidia and Palantir were early losers. 11/18/2025 Stock Market Today: The Dow Jones index dropped 350 points... AI voice assistants could replace touch controls and typing for controlling personal gadgets like smartphones or running applications for organizations. (© Chris Gash) Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Information in Investor’s Business Daily is for informational and educational purposes only and should not be construed as an offer, recommendation, solicitation, or rating to buy or sell securities. The information has been obtained from sources we believe to be reliable, but we make no guarantee as to its accuracy, timeliness, or suitability, including with respect to information that appears in closed captioning. Historical investment performances are no indication or guarantee of future success or performance. Authors/presenters may own the stocks they discuss. We make no representations or warranties regarding the advisability of investing in any particular securities or utilizing any specific investment strategies. Information is subject to change without notice. For information on use of our services, please see our Terms of Use . *Real-time prices by Nasdaq Last Sale. Real-time quote and/or trade prices are not sourced from all markets. Ownership data provided by LSEG and Estimate data provided by FactSet. IBD, IBD Digital, IBD Live, IBD Weekly, Investor's Business Daily, Leaderboard, MarketDiem, MarketSurge and other marks are trademarks owned by Investor's Business Daily, LLC. ©2025 Investor’s Business Daily, LLC. All Rights Reserved."}
]