[
{"company": "AAPL", "title": "Elon Musk's pay package is a clear signal that Tesla is done being just a car company", "publisher": "Yahoo Finance", "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=3_cc-session_120a2afd-ff0c-4526-813c-a98bf7dc7843", "summary": "We've seen Amazon without Jeff Bezos, Apple without Steve Jobs, and Microsoft without Bill Gates, but for the time being, we're not going to see Tesla without Musk.", "time": "2025-11-08 11:00:58", "full_text": "Yahoo fait partie de la famille de marques Famille de marques Yahoo Les sites et applications que nous possédons et exploitons, notamment Yahoo, AOL, Engadget, In The Know et Makers. Yahoo . Si vous ne souhaitez pas que nos partenaires et nous–mêmes utilisions des cookies et vos données personnelles pour ces motifs supplémentaires, cliquez sur Refuser tout . Si vous souhaitez personnaliser vos choix, cliquez sur Gérer les paramètres de confidentialité . Vous pouvez révoquer votre consentement ou modifier vos choix à tout moment en cliquant sur les liens « Paramètres de confidentialité et des cookies » ou « Tableau de bord sur la confidentialité » présents sur nos sites et dans nos applications. Découvrez comment nous utilisons vos données personnelles dans notre Politique de confidentialité et notre Politique concernant les cookies ."},
{"company": "AAPL", "title": "3 Reasons to Buy This Top Tech Stock That's Likely to Join Nvidia, Apple, Microsoft, and Alphabet in the $3 Trillion Market Cap Club Next Year", "publisher": "Motley Fool", "link": "https://www.fool.com/investing/2025/11/09/3-reasons-to-buy-this-top-tech-stock-thats-likely/", "summary": "There are many growth drivers today.", "time": "2025-11-09 11:15:00", "full_text": "There are many growth drivers today. 2025 has been an incredible year for the world's most valuable companies . Nvidia became the first $4 trillion stock in July, and it has already surpassed $5 trillion, while Apple and Microsoft recently hit the $4 trillion mark. Alphabet is the only other stock above $3 trillion in value, and Amazon ( AMZN +0.56% ) is not too far behind, with nearly $2.7 trillion in market cap , as of this writing. The market has been sour on Amazon stock for most of the year, but Amazon got an enthusiastic reaction to its third-quarter earnings report, and while it's still trailing the market this year, it's finally gaining momentum. It's quite probable at this point that Amazon will join the $3 trillion market cap club, which implies only a 12% gain, next year. Here are three reasons why. Image source: Amazon. Part of why Amazon has underwhelmed this year is a slowdown in Amazon Web Services (AWS) at the same time that its cloud services competitors climb higher. Management has maintained that it has the largest and most complete assortment of services for its clients, and it has pointed out that it's still winning in adding dollar amounts, since the percentage growth is over a much wider base than its rivals. It also reassured investors that there's a lot more coming, and it's constantly innovating to grab market share and keep its lead; AWS controls about 30% of the global market for cloud services. That's a substantial lead, although its competitors aren't too far behind. The market finally got a taste of that in the third quarter, when Amazon reported a 20% year-over-year increase in AWS sales. Here's what it's looked like over the past four quarters: Data source: Amazon quarterly reports. The acceleration in sales growth, on top of the wider base, is an impressive feat and implies that clients see it as having more to offer than other providers. AWS is where the artificial intelligence (AI) business happens. AWS clients can engage with Amazon's AI platform, creating all sorts of AI apps at multiple price points and customization options. Management gave a slew of recent AI updates as it tries to be everything to everyone in AI. Some of its solutions include SageMaker, a platform for developers to create their own large-language model for complete customization, as well as Bedrock , a platform that offers developers the use of other LLMs, like Claude and Nova, to design AI apps. The company recently launched AgentCore, a model for building scalable AI agents, Kiro, a program for agent coding, and Transform, a migration tool. Management noted that AWS gets most of the government and large enterprise migrations. All of these services are being used by hundreds of thousands of clients, and Amazon continues to roll out new ones as it gains insight into its customers' needs. To meet unrelenting demand and position itself for more, it's expanding its available power. It added 3.8 gigawatts of power over the past year, which includes chips and data centers, more than any other cloud company. It plans to double that by 2027, including adding another gigawatt over the next year. The AI business already has a $132 billion run rate , and as that increases, it adds important revenue to the company's total. That makes it a shoe-in for improving market sentiment. Let's not forget that e-commerce is still Amazon's main game, and it represented $110 billion of revenue in the third quarter, or nearly two-thirds of the total. There are two primary ways Amazon is improving its value proposition: a better selection of products and improved delivery speed. It has been adding more products from popular brand names like The North Face and Charlotte Tilbury, and it had 14% more products available in its marketplace than last year in the third quarter. It offers fresh, same-day grocery delivery now in 1,000 locations, and it plans to be in 2,300 locations by the end of the year. It also just launched a new button to add items to deliveries that are already scheduled, and it's already been used 80 million times. These are the kinds of upgrades that create loyalty and generate higher sales and customer satisfaction. Although these are three great reasons separately, part of what makes Amazon such a great stock to own is that it has diverse businesses, which means it can handle risk better. That's another reason Amazon stock looks like a buy today. Jennifer Saibil has positions in Apple. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, Microsoft, and Nvidia. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy . *Average returns of all recommendations since inception. Cost basis and return based on previous market day close. Related Articles Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2025 The Motley Fool . All rights reserved. Market data powered by Xignite and Polygon.io . About The Motley Fool Our Services Around the Globe Free Tools Affiliates & Friends"},
{"company": "TSLA", "title": "Tesla’s China sales hit three-year low amid fierce competition", "publisher": "Investing.com", "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=3_cc-session_5362e8c6-45f2-4caf-a1e3-f955a00e6369", "summary": "Investing.com -- Tesla’s sales in China dropped to 26,006 vehicles in October, marking their lowest level in three years as the electric vehicle maker faces challenges with weak demand in the competitive Chinese market.", "time": "2025-11-10 11:39:51", "full_text": "Yahoo fait partie de la famille de marques Famille de marques Yahoo Les sites et applications que nous possédons et exploitons, notamment Yahoo, AOL, Engadget, In The Know et Makers. Yahoo . Si vous ne souhaitez pas que nos partenaires et nous–mêmes utilisions des cookies et vos données personnelles pour ces motifs supplémentaires, cliquez sur Refuser tout . Si vous souhaitez personnaliser vos choix, cliquez sur Gérer les paramètres de confidentialité . Vous pouvez révoquer votre consentement ou modifier vos choix à tout moment en cliquant sur les liens « Paramètres de confidentialité et des cookies » ou « Tableau de bord sur la confidentialité » présents sur nos sites et dans nos applications. Découvrez comment nous utilisons vos données personnelles dans notre Politique de confidentialité et notre Politique concernant les cookies ."},
{"company": "TSLA", "title": "Bitcoin Has 'High Probability' Of Crashing Below $60,000 If It Stays Below This Level, Says Analyst, But The Fall Could Be Even Steeper", "publisher": "Benzinga", "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=3_cc-session_05584a21-f1a1-4fd8-ba50-279860c62fa4", "summary": "A renowned cryptocurrency analyst shared a cautious perspective on Bitcoin’s (CRYPTO: BTC) price on Sunday, hinting at a sharp drop from the current levels. Big Drawdown Incoming For BTC? Ali Martinez, known for scrutinizing chart patterns on-chain ...", "time": "2025-11-10 12:31:09", "full_text": "Yahoo fait partie de la famille de marques Famille de marques Yahoo Les sites et applications que nous possédons et exploitons, notamment Yahoo, AOL, Engadget, In The Know et Makers. Yahoo . Si vous ne souhaitez pas que nos partenaires et nous–mêmes utilisions des cookies et vos données personnelles pour ces motifs supplémentaires, cliquez sur Refuser tout . Si vous souhaitez personnaliser vos choix, cliquez sur Gérer les paramètres de confidentialité . Vous pouvez révoquer votre consentement ou modifier vos choix à tout moment en cliquant sur les liens « Paramètres de confidentialité et des cookies » ou « Tableau de bord sur la confidentialité » présents sur nos sites et dans nos applications. Découvrez comment nous utilisons vos données personnelles dans notre Politique de confidentialité et notre Politique concernant les cookies ."},
{"company": "TSLA", "title": "Tesla Cybertruck executive leaving the Musk-led automaker", "publisher": "Associated Press Finance", "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=3_cc-session_2d662727-c0cb-49b7-88a0-fec0c7b96869", "summary": "The executive leading Tesla's Cybertruck business is leaving the Elon Musk-led automaker after eight years.  Siddhant Awasthi, the program manager for Tesla's Cybertruck and Model 3, said on LinkedIn that it wasn't an easy decision to depart the company.", "time": "2025-11-10 13:17:33", "full_text": "Yahoo fait partie de la famille de marques Famille de marques Yahoo Les sites et applications que nous possédons et exploitons, notamment Yahoo, AOL, Engadget, In The Know et Makers. Yahoo . Si vous ne souhaitez pas que nos partenaires et nous–mêmes utilisions des cookies et vos données personnelles pour ces motifs supplémentaires, cliquez sur Refuser tout . Si vous souhaitez personnaliser vos choix, cliquez sur Gérer les paramètres de confidentialité . Vous pouvez révoquer votre consentement ou modifier vos choix à tout moment en cliquant sur les liens « Paramètres de confidentialité et des cookies » ou « Tableau de bord sur la confidentialité » présents sur nos sites et dans nos applications. Découvrez comment nous utilisons vos données personnelles dans notre Politique de confidentialité et notre Politique concernant les cookies ."},
{"company": "TSLA", "title": "Elon Musk is 'maniacally dedicated' to Tesla, analyst says", "publisher": "Yahoo Finance Video", "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=3_cc-session_f024d017-fdee-4532-9e8c-416662fb865b", "summary": "ARK Invest chief futurist, Brett Winton, joins Morning Brief host Julie Hyman to discuss the milestones included in Tesla (TSLA) CEO Elon Musk's $1 trillion pay package and whether the loftiness is a risk. To watch more expert insights and analysis on the latest market action, check out more Morning Brief.", "time": "2025-11-09 19:00:35", "full_text": "Yahoo fait partie de la famille de marques Famille de marques Yahoo Les sites et applications que nous possédons et exploitons, notamment Yahoo, AOL, Engadget, In The Know et Makers. Yahoo . Si vous ne souhaitez pas que nos partenaires et nous–mêmes utilisions des cookies et vos données personnelles pour ces motifs supplémentaires, cliquez sur Refuser tout . Si vous souhaitez personnaliser vos choix, cliquez sur Gérer les paramètres de confidentialité . Vous pouvez révoquer votre consentement ou modifier vos choix à tout moment en cliquant sur les liens « Paramètres de confidentialité et des cookies » ou « Tableau de bord sur la confidentialité » présents sur nos sites et dans nos applications. Découvrez comment nous utilisons vos données personnelles dans notre Politique de confidentialité et notre Politique concernant les cookies ."},
{"company": "TSLA", "title": "Stock Market Today: Dow Rises On Shutdown Deal Hopes; UnitedHealth Tumbles On Trump Comments (Live Coverage)", "publisher": "Investor's Business Daily", "link": "https://www.investors.com/market-trend/stock-market-today/dow-jones-sp500-nasdaq-government-shutdown-deal/?src=A00220&yptr=yahoo", "summary": "Stock Market Today: The Dow Jones index rose after a deal to end the government shutdown passed a key vote late Sunday, UnitedHealth tumbled.", "time": "2025-11-10 13:33:23", "full_text": "BREAKING: Futures Rise As Shutdown Deal Advances Investors.com will undergo scheduled maintenance from 10:00 PM ET to 2:00 AM ET and some features may be unavailable. We apologize for any inconvenience. Futures for the Dow Jones Industrial Average and the other major stock indexes rose in premarket action Monday after a deal to end the government shutdown passed a key vote late Sunday. Meanwhile, UnitedHealth Group (UNH) was a loser on the stock market today after President Donald Trump's comments on health insurers. Ahead of the opening bell, the Dow rose… 11/09/2025 Amid hype over artificial intelligence, the best AI stocks generate revenue or get a strategic edge from the fast evolving... 11/09/2025 Amid hype over artificial intelligence, the best AI stocks generate... Weight-loss drugs could be a $150 billion market by 2035, according to Morgan Stanley. (© Gary Neill) Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Information in Investor’s Business Daily is for informational and educational purposes only and should not be construed as an offer, recommendation, solicitation, or rating to buy or sell securities. The information has been obtained from sources we believe to be reliable, but we make no guarantee as to its accuracy, timeliness, or suitability, including with respect to information that appears in closed captioning. Historical investment performances are no indication or guarantee of future success or performance. Authors/presenters may own the stocks they discuss. We make no representations or warranties regarding the advisability of investing in any particular securities or utilizing any specific investment strategies. Information is subject to change without notice. For information on use of our services, please see our Terms of Use . *Real-time prices by Nasdaq Last Sale. Real-time quote and/or trade prices are not sourced from all markets. Ownership data provided by LSEG and Estimate data provided by FactSet. IBD, IBD Digital, IBD Live, IBD Weekly, Investor's Business Daily, Leaderboard, MarketDiem, MarketSurge and other marks are trademarks owned by Investor's Business Daily, LLC. ©2025 Investor’s Business Daily, LLC. All Rights Reserved."},
{"company": "TSLA", "title": "Elon Musk's pay package is a clear signal that Tesla is done being just a car company", "publisher": "Yahoo Finance", "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=3_cc-session_bdaf6965-bad9-4862-9df9-f47157059983", "summary": "We've seen Amazon without Jeff Bezos, Apple without Steve Jobs, and Microsoft without Bill Gates, but for the time being, we're not going to see Tesla without Musk.", "time": "2025-11-08 11:00:58", "full_text": "Yahoo fait partie de la famille de marques Famille de marques Yahoo Les sites et applications que nous possédons et exploitons, notamment Yahoo, AOL, Engadget, In The Know et Makers. Yahoo . Si vous ne souhaitez pas que nos partenaires et nous–mêmes utilisions des cookies et vos données personnelles pour ces motifs supplémentaires, cliquez sur Refuser tout . Si vous souhaitez personnaliser vos choix, cliquez sur Gérer les paramètres de confidentialité . Vous pouvez révoquer votre consentement ou modifier vos choix à tout moment en cliquant sur les liens « Paramètres de confidentialité et des cookies » ou « Tableau de bord sur la confidentialité » présents sur nos sites et dans nos applications. Découvrez comment nous utilisons vos données personnelles dans notre Politique de confidentialité et notre Politique concernant les cookies ."},
{"company": "AAPL", "title": "Why buying property before the budget might bag you a bargain", "publisher": "Yahoo Finance UK", "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=3_cc-session_8e3174bf-bb57-4208-b8a9-714f7b27c70e", "summary": "In the current property market, 20% discounts aren’t uncommon but what are the risks?", "time": "2025-11-10 06:00:11", "full_text": "Yahoo is part of the Yahoo family of brands The sites and apps that we own and operate, including Yahoo, AOL, Engadget, In The Know and Makers. Yahoo family of brands. If you do not want us and our partners to use cookies and personal data for these additional purposes, click ' Reject all '. If you would like to customise your choices, click ' Manage privacy settings '. You can withdraw your consent or change your choices at any time by clicking on the 'Privacy & cookie settings' or 'Privacy dashboard' links on our sites and apps. Find out more about how we use your personal data in our privacy policy and cookie policy ."},
{"company": "AAPL", "title": "Did Warren Buffett Sell More Shares of Apple?", "publisher": "Motley Fool", "link": "https://www.fool.com/investing/2025/11/10/did-warren-buffett-sell-more-shares-of-apple/", "summary": "Apple has long been the largest position in Berkshire Hathaway's huge equities portfolio.", "time": "2025-11-10 08:55:00", "full_text": "Apple has long been the largest position in Berkshire Hathaway's huge equities portfolio. Apple ( AAPL 0.45% ) has long held the esteemed honor of being the largest holding in Berkshire Hathaway 's ( BRK.A +1.14% ) ( BRK.B +1.20% ) huge $312 billion equities portfolio, which, for the past six decades, has been run by none other than Warren Buffett, arguably one of the greatest investors of all time. At one point, Apple made up 40% of Berkshire's portfolio. The company began losing enthusiasm for the stock in 2023 and since then has sold roughly two-thirds of that position. Despite that, the stock still made up over 24% of Berkshire's portfolio at the end of the second quarter. Did Buffett and Berkshire sell more shares of Apple in the third quarter? Berkshire recently reported its third-quarter earnings, but the company likely won't report its third-quarter 13F filing , detailing changes in the equities portfolio, until Nov. 14. Funds of a certain size must file 13F forms no later than 45 days after each quarter ends. However, there were some clues in the third-quarter report that the company may have continued to trim its position in Apple. Image source: Getty Images. For one, Berkshire said in its earnings release that it had after-tax realized gains on sales of investments of $8.2 billion during the quarter. As Barron's pointed out, that kind of gain on only about $12 billion of equity sales in the quarter would be consistent with a sale of Apple. Berkshire's cost basis on its consumer stocks also fell in the quarter from about $13.4 billion in the second quarter to about $12.2 billion in the third quarter. It would not be surprising to see Berkshire continue to pare its position in Apple over time. When it dumped all of its airline holdings in 2020, Buffett said, \"When we sell something, very often it's going to be our entire stake: We don't trim positions.\" Now, Apple could be different given the position's size, but the size could also explain why it will take Berkshire so long to exit the position. Buffett has previously said that his company's size, and the size of its positions, make it difficult to go in and out of stocks quickly. Apple has been a great investment for Berkshire. Buffett said he initially got interested in the business in 2016 when he saw how attached one of his friends was to the iPhone, the company's flagship product. Berkshire continued to buy the stock for several years after that, but just looking back at the stock's performance since 2016, Apple has been a very good investment. It's always difficult to pinpoint why Buffett sours on a position. But Apple and other large tech stocks have become expensive in recent years. The iPhone maker is also still dealing with the fallout from tariffs, and many investors are concerned that management doesn't have a strong enough strategy to capitalize on the artificial intelligence boom . It also would not be surprising to see Berkshire continue to trim its stake in Apple because Buffett and his team are clearly concerned about elevated valuations in the market. The company has purchased very few stocks this year, hasn't repurchased a single share of its own stock, and continues to accumulate record amounts of cash and short-term U.S. Treasury bills. Berkshire's stock has generated outstanding returns over many decades because management has been able to avoid the brunt of economic downturns and invest with a long-term view over an economic cycle. If Buffett and his team view tech valuations as inflated, they won't hesitate to sell. Bram Berkowitz has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Apple and Berkshire Hathaway. The Motley Fool has a disclosure policy . *Average returns of all recommendations since inception. Cost basis and return based on previous market day close. Related Articles Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2025 The Motley Fool . All rights reserved. Market data powered by Xignite and Polygon.io . About The Motley Fool Our Services Around the Globe Free Tools Affiliates & Friends"},
{"company": "AAPL", "title": "1 Spectacular Growth Stock to Buy Before It Joins Nvidia, Apple, Microsoft, and Alphabet in the $3 Trillion Club", "publisher": "Motley Fool", "link": "https://www.fool.com/investing/2025/11/10/growth-stock-buy-nvidia-alphabet-3-trillion-club/", "summary": "Amazon's cloud business just grew at the fastest pace in three years, thanks to artificial intelligence.", "time": "2025-11-10 09:56:00", "full_text": "Amazon's cloud business just grew at the fastest pace in three years, thanks to artificial intelligence. Nine American companies are valued at $1 trillion or more, and four of them have graduated into the ultra-exclusive $3 trillion club: I think Amazon ( AMZN +0.64% ) could join them as early as next year. Revenue growth at the company's industry-leading cloud business just accelerated in the third quarter of 2025 (ended Sept. 30) thanks to artificial intelligence (AI), while efficiency continued to improve in its enormous e-commerce segment. Amazon has a market capitalization of $2.6 trillion as I write this, so the $3 trillion milestone could be a mere formality if the company maintains its current momentum. Read on. Image source: Amazon. Amazon Web Services (AWS) is the world's largest cloud computing platform. It offers hundreds of tools to help businesses thrive in the digital age, including an expanding portfolio of solutions designed to help them deploy AI. Like most cloud providers, AWS operates data centers fitted with Nvidia's advanced graphics processing units ( GPUs ), which are the gold standard for AI development. However, Amazon also designs its own chips in-house, like the Trainium2, which can reduce AI training costs by up to 40%. Trainium2 is now a multibillion-dollar product, and it grew by 150% sequentially during the third quarter (compared to the second quarter). Anthropic , a leading start-up that competes with OpenAI , is training its latest Claude AI models on 500,000 Trainium2 chips, with plans to expand to 1 million before this year is over. If more developers adopt Trainium chips through AWS, the cloud platform could see expanding profit margins because they are much cheaper to deploy than the pricey GPUs supplied by third parties like Nvidia. Overall, AWS generated a record $33 billion in revenue during the third quarter, which was up 20% year over year. It marked an acceleration from the 17% increase in the second quarter, and it was actually the fastest growth in almost three years (since the fourth quarter of 2022). The company is on track to spend $125 billion on AI data center infrastructure in 2025, and CEO Andy Jassy says customers have been soaking up the computing capacity as soon as it comes online. In fact, AWS had an order backlog worth $200 billion at the end of the third quarter from customers that are waiting for more data center capacity, so the cloud platform's momentum is unlikely to slow anytime soon. AWS accounted for just 18% of Amazon's total revenue of $180 billion in the third quarter, but it was responsible for 65% of the company's operating income . In other words, the cloud platform is the profitability engine behind the entire organization. E-commerce remains its single largest source of revenue, but it typically runs on razor-thin profit margins because amazon.com aims to provide customers with the lowest possible prices. The company is working hard to improve margins by boosting efficiency. In 2023, it broke its U.S. logistics network into eight regions, and the products stored in its fulfillment centers are now specific to each geographic area based on their popularity. This means orders travel shorter distances to reach customers, which lowers costs. Amazon also uses over 1 million robots across its fulfillment network to improve productivity, and the company expects that number to grow. These AI-powered machines can retrieve inventory, move products across fulfillment centers, and even pack orders. Since they don't need breaks or days off, they are powerful tools in the quest to improve profit margins. The efficiency measures across the e-commerce business, combined with the strength in AWS, drove Amazon's earnings to $1.95 per share in the third quarter, which was up 36% from the year-ago period. The result crushed Wall Street's earnings estimate of $1.57 per share, which has become a trend -- the company has now topped analysts' expectations in every quarter of 2025 so far. Based on Amazon's trailing-12-month earnings of $7.08 per share, its stock is trading at a price-to-earnings ratio (P/E) of 35.1. Since the Nasdaq-100 index trades at a P/E of 34.7, you could argue that the stock is fairly valued relative to its big-tech peers. However, Wall Street's consensus estimate (provided by Yahoo! Finance) suggests its earnings could grow to $7.81 per share in 2026, placing its stock at a forward P/E of 31.8. That means the stock would have to climb by around 10.3% by the end of next year just to maintain its current P/E of 35.1, which would take its market cap to $2.93 trillion. Keep in mind that Amazon has made a habit of blowing Wall Street's estimates out of the water, so even a small beat next year could push the company into the ultra-exclusive $3 trillion club. Anthony Di Pizio has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, Microsoft, and Nvidia. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy . *Average returns of all recommendations since inception. Cost basis and return based on previous market day close. Related Articles Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2025 The Motley Fool . All rights reserved. Market data powered by Xignite and Polygon.io . About The Motley Fool Our Services Around the Globe Free Tools Affiliates & Friends"},
{"company": "AAPL", "title": "TSMC Sales Cool After Record Surge -- AI Orders Keep Outlook Bright", "publisher": "GuruFocus.com", "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=3_cc-session_6c7d25ee-5c37-4067-907e-38cb9e62c1d7", "summary": "TSMC Revenue Growth Slows, But AI Demand Still Powers the Chip Giant", "time": "2025-11-10 12:12:28", "full_text": "Yahoo fait partie de la famille de marques Famille de marques Yahoo Les sites et applications que nous possédons et exploitons, notamment Yahoo, AOL, Engadget, In The Know et Makers. Yahoo . Si vous ne souhaitez pas que nos partenaires et nous–mêmes utilisions des cookies et vos données personnelles pour ces motifs supplémentaires, cliquez sur Refuser tout . Si vous souhaitez personnaliser vos choix, cliquez sur Gérer les paramètres de confidentialité . Vous pouvez révoquer votre consentement ou modifier vos choix à tout moment en cliquant sur les liens « Paramètres de confidentialité et des cookies » ou « Tableau de bord sur la confidentialité » présents sur nos sites et dans nos applications. Découvrez comment nous utilisons vos données personnelles dans notre Politique de confidentialité et notre Politique concernant les cookies ."},
{"company": "AAPL", "title": "Do you think gold prices will hit $5,000 next year? Have your say", "publisher": "Yahoo Finance UK", "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=3_cc-session_1494e503-85f4-4b9c-bec8-000a18098ff2", "summary": "Investors have continued to turn to gold this year, as economic and political uncertainty has fuelled safe-haven demand.", "time": "2025-11-10 13:30:14", "full_text": "Yahoo is part of the Yahoo family of brands The sites and apps that we own and operate, including Yahoo, AOL, Engadget, In The Know and Makers. Yahoo family of brands. If you do not want us and our partners to use cookies and personal data for these additional purposes, click ' Reject all '. If you would like to customise your choices, click ' Manage privacy settings '. You can withdraw your consent or change your choices at any time by clicking on the 'Privacy & cookie settings' or 'Privacy dashboard' links on our sites and apps. Find out more about how we use your personal data in our privacy policy and cookie policy ."}
]